## Terraform Plan For Approval :
  
  #### Terraform Plan 📖\`success\`
  <details><summary>Show Plan</summary>
  \`\`\`\n
                    
    Acquiring state lock. This may take a few moments...
  
  Terraform used the selected providers to generate the following execution
  plan. Resource actions are indicated with the following symbols:
    + create
   <= read (data resources)
  
  Terraform will perform the following actions:
  
    # data.aws_eks_cluster.main will be read during apply
    # (config refers to values not yet known)
   <= data "aws_eks_cluster" "main"  {
        + arn                       = (known after apply)
        + certificate_authority     = (known after apply)
        + created_at                = (known after apply)
        + enabled_cluster_log_types = (known after apply)
        + endpoint                  = (known after apply)
        + id                        = (known after apply)
        + identity                  = (known after apply)
        + kubernetes_network_config = (known after apply)
        + name                      = (known after apply)
        + platform_version          = (known after apply)
        + role_arn                  = (known after apply)
        + status                    = (known after apply)
        + tags                      = (known after apply)
        + version                   = (known after apply)
        + vpc_config                = (known after apply)
      }
  
    # data.aws_eks_cluster_auth.main will be read during apply
    # (config refers to values not yet known)
   <= data "aws_eks_cluster_auth" "main"  {
        + id    = (known after apply)
        + name  = (known after apply)
        + token = (sensitive value)
      }
  
    # module.mcmp.data.aws_iam_policy_document.admin will be read during apply
    # (config refers to values not yet known)
   <= data "aws_iam_policy_document" "admin"  {
        + id   = (known after apply)
        + json = (known after apply)
  
        + statement {
            + actions   = [
                + "sts:AssumeRole",
              ]
            + effect    = "Allow"
            + resources = [
                + (known after apply),
              ]
          }
      }
  
    # module.mcmp.data.aws_iam_policy_document.viewer will be read during apply
    # (config refers to values not yet known)
   <= data "aws_iam_policy_document" "viewer"  {
        + id   = (known after apply)
        + json = (known after apply)
  
        + statement {
            + actions   = [
                + "sts:AssumeRole",
              ]
            + effect    = "Allow"
            + resources = [
                + (known after apply),
              ]
          }
      }
  
    # module.mcmp.data.mongodbatlas_network_container.peer[0] will be read during apply
    # (config refers to values not yet known)
   <= data "mongodbatlas_network_container" "peer"  {
        + atlas_cidr_block      = (known after apply)
        + azure_subscription_id = (known after apply)
        + container_id          = (known after apply)
        + gcp_project_id        = (known after apply)
        + id                    = (known after apply)
        + network_name          = (known after apply)
        + project_id            = (known after apply)
        + provider_name         = (known after apply)
        + provisioned           = (known after apply)
        + region                = (known after apply)
        + region_name           = (known after apply)
        + regions               = (known after apply)
        + vnet_name             = (known after apply)
        + vpc_id                = (known after apply)
      }
  
    # module.mcmp.aws_acm_certificate.cert will be created
    + resource "aws_acm_certificate" "cert" {
        + arn                       = (known after apply)
        + certificate_body          = <<-EOT
              -----BEGIN CERTIFICATE-----
              MIIHXjCCBkagAwIBAgIQDxNVPxa6z/o9/vXZpGMNszANBgkqhkiG9w0BAQsFADBN
              MQswCQYDVQQGEwJVUzEVMBMGA1UEChMMRGlnaUNlcnQgSW5jMScwJQYDVQQDEx5E
              aWdpQ2VydCBTSEEyIFNlY3VyZSBTZXJ2ZXIgQ0EwHhcNMjAwNjAxMDAwMDAwWhcN
              MjIwOTA0MDAwMDAwWjCBnTELMAkGA1UEBhMCVVMxDjAMBgNVBAgTBVRleGFzMQ8w
              DQYDVQQHEwZBdXN0aW4xNDAyBgNVBAoTK0ludGVybmF0aW9uYWwgQnVzaW5lc3Mg
              TWFjaGluZXMgQ29ycG9yYXRpb24xGDAWBgNVBAsTD0Nsb3VkIEJyb2tlcmFnZTEd
              MBsGA1UEAwwUKi5tdWx0aWNsb3VkLWlibS5jb20wggEiMA0GCSqGSIb3DQEBAQUA
              A4IBDwAwggEKAoIBAQDyCe9cAXutIT0G8aiclD9BTVoC2xHrxfT4pBeldPNfieSv
              yHJzydmvpDOeT3cqQIg5Y+W5GnNAqw2+VcL+oELhKzJyuTodETurvWh91QJaWJVj
              xxEoVopCRo/XIeEXUJ7iMjZ/KdtVoGq0yf6qcI8R8d0Noz8mDy8FAyFSl9SVtHkK
              EjYd2dTwoxh8I72DVgu+UGncMrKaVydX0O63pdejeCkn6eT4mOd4uVYtSCUx9DQz
              g9NVsMYE+VlrgOM+czyCIsbPuAmrEtOgEcZHwTbayC3ng9EDSk4ZnJctr307Jz6E
              olenRs4dyZiIPz0qXvx6E5N1OCXVbfRbfgO6jg+/AgMBAAGjggPnMIID4zAfBgNV
              HSMEGDAWgBQPgGEcgjFh1S8o541GOLQs4cbZ4jAdBgNVHQ4EFgQUt0GnZ43rsfGe
              q0YyumOn1nNz6iswMwYDVR0RBCwwKoIUKi5tdWx0aWNsb3VkLWlibS5jb22CEm11
              bHRpY2xvdWQtaWJtLmNvbTAOBgNVHQ8BAf8EBAMCBaAwHQYDVR0lBBYwFAYIKwYB
              BQUHAwEGCCsGAQUFBwMCMGsGA1UdHwRkMGIwL6AtoCuGKWh0dHA6Ly9jcmwzLmRp
              Z2ljZXJ0LmNvbS9zc2NhLXNoYTItZzYuY3JsMC+gLaArhilodHRwOi8vY3JsNC5k
              aWdpY2VydC5jb20vc3NjYS1zaGEyLWc2LmNybDBMBgNVHSAERTBDMDcGCWCGSAGG
              /WwBATAqMCgGCCsGAQUFBwIBFhxodHRwczovL3d3dy5kaWdpY2VydC5jb20vQ1BT
              MAgGBmeBDAECAjB8BggrBgEFBQcBAQRwMG4wJAYIKwYBBQUHMAGGGGh0dHA6Ly9v
              Y3NwLmRpZ2ljZXJ0LmNvbTBGBggrBgEFBQcwAoY6aHR0cDovL2NhY2VydHMuZGln
              aWNlcnQuY29tL0RpZ2lDZXJ0U0hBMlNlY3VyZVNlcnZlckNBLmNydDAMBgNVHRMB
              Af8EAjAAMIIB9AYKKwYBBAHWeQIEAgSCAeQEggHgAd4AdQApeb7wnjk5IfBWc59j
              pXflvld9nGAK+PlNXSZcJV3HhAAAAXJw1G7iAAAEAwBGMEQCIBBg100YKikcNGfa
              Cn8vDAiHWFpsab0m09zeZb9r2ezMAiB3pBz0y0ga9aVKDywXITnw4YL7n/gmUttD
              vNclr3SYWgB1ACJFRQdZVSRWlj+hL/H3bYbgIyZjrcBLf13Gg1xu4g8CAAABcnDU
              bxAAAAQDAEYwRAIgZCWZh/XrKp6ASw3r6nOR+l8ijW+zf9wEai08vaZx0v0CICks
              wzePjv4RoBOAF8aYw2S6KaQHShnd0S4iJp6ukLfzAHYAUaOw9f0BeZxWbbg3eI8M
              pHrMGyfL956IQpoN/tSLBeUAAAFycNRvXwAABAMARzBFAiEAkRyUHlmPwf9oOBkP
              sE+y+UFIwx6sQ3QwpyYqU0yMh5YCIGAN6xxW18LEmVTMrzOp1go14BD127dv5mo7
              ouMruiQFAHYAQcjKsd8iRkoQxqE6CUKHXk4xixsD6+tLx2jwkGKWBvYAAAFycNRu
              owAABAMARzBFAiAhI4rhxM06PGmMd+lKADPmfOY9bn/a8eTRmIiMwUco3gIhAJc/
              l4Qd1yoHpVxhC49gxem12y/Arn47M+1QF+fSEPQiMA0GCSqGSIb3DQEBCwUAA4IB
              AQDQc20IcKJccclipBTdEUMj8whaaOds5nbpp5gYJFHphVqN0H+/qyUaR95yjfcu
              KNhojR8hNAb7od2GYxF9AfBojmI/WMYj1HLiV6P2aRulWBKA2wcCE3EZjDp4UIke
              wBEDEUTZu2tmkKxnD97KEirMXhw44wWzWvcaDxrPys26fp7ogglHmpjsY4cpqs35
              2dTlc5JTQBwM30cTWhRRdlP101keGv+qevOHlhAozcJCIld2iG/5xkTThSmY4cNj
              XEoNLENW5z0pyrJqwnb5sKPUyYsO7eSFOY2WhoZrK8yBtwdH3a3t1+SdNVDCAFOB
              k74cSEs/DNaPuB4U5LgU38QL
              -----END CERTIFICATE-----
          EOT
        + certificate_chain         = <<-EOT
              -----BEGIN CERTIFICATE-----
              MIIE6DCCA9CgAwIBAgIQAnQuqhfKjiHHF7sf/P0MoDANBgkqhkiG9w0BAQsFADBh
              MQswCQYDVQQGEwJVUzEVMBMGA1UEChMMRGlnaUNlcnQgSW5jMRkwFwYDVQQLExB3
              d3cuZGlnaWNlcnQuY29tMSAwHgYDVQQDExdEaWdpQ2VydCBHbG9iYWwgUm9vdCBD
              QTAeFw0yMDA5MjMwMDAwMDBaFw0zMDA5MjIyMzU5NTlaME0xCzAJBgNVBAYTAlVT
              MRUwEwYDVQQKEwxEaWdpQ2VydCBJbmMxJzAlBgNVBAMTHkRpZ2lDZXJ0IFNIQTIg
              U2VjdXJlIFNlcnZlciBDQTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEB
              ANyuWJBNwcQwFZA1W248ghX1LFy949v/cUP6ZCWA1O4Yok3wZtAKc24RmDYXZK83
              nf36QYSvx6+M/hpzTc8zl5CilodTgyu5pnVILR1WN3vaMTIa16yrBvSqXUu3R0bd
              KpPDkC55gIDvEwRqFDu1m5K+wgdlTvza/P96rtxcflUxDOg5B6TXvi/TC2rSsd9f
              /ld0Uzs1gN2ujkSYs58O09rg1/RrKatEp0tYhG2SS4HD2nOLEpdIkARFdRrdNzGX
              kujNVA075ME/OV4uuPNcfhCOhkEAjUVmR7ChZc6gqikJTvOX6+guqw9ypzAO+sf0
              /RR3w6RbKFfCs/mC/bdFWJsCAwEAAaOCAa4wggGqMB0GA1UdDgQWBBQPgGEcgjFh
              1S8o541GOLQs4cbZ4jAfBgNVHSMEGDAWgBQD3lA1VtFMu2bwo+IbG8OXsj3RVTAO
              BgNVHQ8BAf8EBAMCAYYwHQYDVR0lBBYwFAYIKwYBBQUHAwEGCCsGAQUFBwMCMBIG
              A1UdEwEB/wQIMAYBAf8CAQAwdgYIKwYBBQUHAQEEajBoMCQGCCsGAQUFBzABhhho
              dHRwOi8vb2NzcC5kaWdpY2VydC5jb20wQAYIKwYBBQUHMAKGNGh0dHA6Ly9jYWNl
              cnRzLmRpZ2ljZXJ0LmNvbS9EaWdpQ2VydEdsb2JhbFJvb3RDQS5jcnQwewYDVR0f
              BHQwcjA3oDWgM4YxaHR0cDovL2NybDMuZGlnaWNlcnQuY29tL0RpZ2lDZXJ0R2xv
              YmFsUm9vdENBLmNybDA3oDWgM4YxaHR0cDovL2NybDQuZGlnaWNlcnQuY29tL0Rp
              Z2lDZXJ0R2xvYmFsUm9vdENBLmNybDAwBgNVHSAEKTAnMAcGBWeBDAEBMAgGBmeB
              DAECATAIBgZngQwBAgIwCAYGZ4EMAQIDMA0GCSqGSIb3DQEBCwUAA4IBAQB3MR8I
              l9cSm2PSEWUIpvZlubj6kgPLoX7hyA2MPrQbkb4CCF6fWXF7Ef3gwOOPWdegUqHQ
              S1TSSJZI73fpKQbLQxCgLzwWji3+HlU87MOY7hgNI+gH9bMtxKtXc1r2G1O6+x/6
              vYzTUVEgR17vf5irF0LKhVyfIjc0RXbyQ14AniKDrN+v0ebHExfppGlkTIBn6rak
              f4994VH6npdn6mkus5CkHBXIrMtPKex6XF2firjUDLuU7tC8y7WlHgjPxEEDDb0G
              w6D0yDdVSvG/5XlCNatBmO/8EznDu1vr72N8gJzISUZwa6CCUD7QBLbKJcXBBVVf
              8nwvV9GvlW+sbXlr
              -----END CERTIFICATE-----
          EOT
        + domain_name               = (known after apply)
        + domain_validation_options = (known after apply)
        + id                        = (known after apply)
        + private_key               = (sensitive value)
        + status                    = (known after apply)
        + subject_alternative_names = (known after apply)
        + tags                      = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419"
            + "environment_type" = "dev"
          }
        + tags_all                  = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419"
            + "environment_type" = "dev"
          }
        + validation_emails         = (known after apply)
        + validation_method         = (known after apply)
      }
  
    # module.mcmp.aws_cloudwatch_log_group.log_group["actions"] will be created
    + resource "aws_cloudwatch_log_group" "log_group" {
        + arn               = (known after apply)
        + id                = (known after apply)
        + name              = "mumbai-dev-39e419-actions-LogGroup"
        + retention_in_days = 0
        + tags              = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-actions-LogGroup"
            + "environment_type" = "dev"
          }
        + tags_all          = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-actions-LogGroup"
            + "environment_type" = "dev"
          }
      }
  
    # module.mcmp.aws_cloudwatch_log_group.log_group["consume"] will be created
    + resource "aws_cloudwatch_log_group" "log_group" {
        + arn               = (known after apply)
        + id                = (known after apply)
        + name              = "mumbai-dev-39e419-consume-LogGroup"
        + retention_in_days = 0
        + tags              = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-consume-LogGroup"
            + "environment_type" = "dev"
          }
        + tags_all          = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-consume-LogGroup"
            + "environment_type" = "dev"
          }
      }
  
    # module.mcmp.aws_cloudwatch_log_group.log_group["coreplus"] will be created
    + resource "aws_cloudwatch_log_group" "log_group" {
        + arn               = (known after apply)
        + id                = (known after apply)
        + name              = "mumbai-dev-39e419-coreplus-LogGroup"
        + retention_in_days = 0
        + tags              = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-coreplus-LogGroup"
            + "environment_type" = "dev"
          }
        + tags_all          = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-coreplus-LogGroup"
            + "environment_type" = "dev"
          }
      }
  
    # module.mcmp.aws_eip.private will be created
    + resource "aws_eip" "private" {
        + allocation_id        = (known after apply)
        + association_id       = (known after apply)
        + carrier_ip           = (known after apply)
        + customer_owned_ip    = (known after apply)
        + domain               = (known after apply)
        + id                   = (known after apply)
        + instance             = (known after apply)
        + network_border_group = (known after apply)
        + network_interface    = (known after apply)
        + private_dns          = (known after apply)
        + private_ip           = (known after apply)
        + public_dns           = (known after apply)
        + public_ip            = (known after apply)
        + public_ipv4_pool     = (known after apply)
        + tags                 = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419"
            + "environment_type" = "dev"
          }
        + tags_all             = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419"
            + "environment_type" = "dev"
          }
        + vpc                  = true
      }
  
    # module.mcmp.aws_eks_cluster.main will be created
    + resource "aws_eks_cluster" "main" {
        + arn                       = (known after apply)
        + certificate_authority     = (known after apply)
        + created_at                = (known after apply)
        + enabled_cluster_log_types = [
            + "api",
            + "audit",
            + "authenticator",
            + "controllerManager",
            + "scheduler",
          ]
        + endpoint                  = (known after apply)
        + id                        = (known after apply)
        + identity                  = (known after apply)
        + name                      = "mumbai-dev-39e419"
        + platform_version          = (known after apply)
        + role_arn                  = (known after apply)
        + status                    = (known after apply)
        + tags                      = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all                  = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + version                   = "1.19"
  
        + kubernetes_network_config {
            + service_ipv4_cidr = (known after apply)
          }
  
        + vpc_config {
            + cluster_security_group_id = (known after apply)
            + endpoint_private_access   = true
            + endpoint_public_access    = true
            + public_access_cidrs       = (known after apply)
            + security_group_ids        = (known after apply)
            + subnet_ids                = (known after apply)
            + vpc_id                    = (known after apply)
          }
      }
  
    # module.mcmp.aws_eks_node_group.main["default"] will be created
    + resource "aws_eks_node_group" "main" {
        + ami_type               = (known after apply)
        + arn                    = (known after apply)
        + capacity_type          = (known after apply)
        + cluster_name           = "mumbai-dev-39e419"
        + disk_size              = 20
        + id                     = (known after apply)
        + instance_types         = [
            + "t3.medium",
          ]
        + labels                 = {
            + "Environment" = "dev"
          }
        + node_group_name        = "default"
        + node_group_name_prefix = (known after apply)
        + node_role_arn          = (known after apply)
        + release_version        = (known after apply)
        + resources              = (known after apply)
        + status                 = (known after apply)
        + subnet_ids             = (known after apply)
        + tags                   = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all               = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + version                = "1.19"
  
        + scaling_config {
            + desired_size = 3
            + max_size     = 6
            + min_size     = 3
          }
      }
  
    # module.mcmp.aws_elasticache_replication_group.redis["actions"] will be created
    + resource "aws_elasticache_replication_group" "redis" {
        + apply_immediately              = (known after apply)
        + arn                            = (known after apply)
        + at_rest_encryption_enabled     = true
        + auth_token                     = (sensitive value)
        + auto_minor_version_upgrade     = true
        + automatic_failover_enabled     = true
        + availability_zones             = [
            + "***a",
            + "***b",
            + "***c",
          ]
        + cluster_enabled                = (known after apply)
        + configuration_endpoint_address = (known after apply)
        + engine                         = "redis"
        + engine_version                 = "6.x"
        + engine_version_actual          = (known after apply)
        + global_replication_group_id    = (known after apply)
        + id                             = (known after apply)
        + maintenance_window             = "sat:10:00-sat:11:00"
        + member_clusters                = (known after apply)
        + multi_az_enabled               = true
        + node_type                      = "cache.r6g.large"
        + number_cache_clusters          = 3
        + parameter_group_name           = "default.redis6.x"
        + port                           = 6379
        + primary_endpoint_address       = (known after apply)
        + reader_endpoint_address        = (known after apply)
        + replication_group_description  = "Hyperscaler Elasticache(Redis)"
        + replication_group_id           = "mumbai-dev-39e419-actions-redis"
        + security_group_ids             = (known after apply)
        + security_group_names           = (known after apply)
        + snapshot_retention_limit       = 1
        + snapshot_window                = "05:30-06:30"
        + subnet_group_name              = "mumbai-dev-39e419-elasticachesubnetgroup"
        + tags                           = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-actions-redis"
            + "environment_type" = "dev"
          }
        + tags_all                       = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-actions-redis"
            + "environment_type" = "dev"
          }
        + transit_encryption_enabled     = true
  
        + cluster_mode {
            + num_node_groups         = (known after apply)
            + replicas_per_node_group = (known after apply)
          }
      }
  
    # module.mcmp.aws_elasticache_replication_group.redis["consume"] will be created
    + resource "aws_elasticache_replication_group" "redis" {
        + apply_immediately              = (known after apply)
        + arn                            = (known after apply)
        + at_rest_encryption_enabled     = true
        + auth_token                     = (sensitive value)
        + auto_minor_version_upgrade     = true
        + automatic_failover_enabled     = true
        + availability_zones             = [
            + "***a",
            + "***b",
            + "***c",
          ]
        + cluster_enabled                = (known after apply)
        + configuration_endpoint_address = (known after apply)
        + engine                         = "redis"
        + engine_version                 = "6.x"
        + engine_version_actual          = (known after apply)
        + global_replication_group_id    = (known after apply)
        + id                             = (known after apply)
        + maintenance_window             = "sat:10:00-sat:11:00"
        + member_clusters                = (known after apply)
        + multi_az_enabled               = true
        + node_type                      = "cache.r6g.large"
        + number_cache_clusters          = 3
        + parameter_group_name           = "default.redis6.x"
        + port                           = 6379
        + primary_endpoint_address       = (known after apply)
        + reader_endpoint_address        = (known after apply)
        + replication_group_description  = "Hyperscaler Elasticache(Redis)"
        + replication_group_id           = "mumbai-dev-39e419-consume-redis"
        + security_group_ids             = (known after apply)
        + security_group_names           = (known after apply)
        + snapshot_retention_limit       = 1
        + snapshot_window                = "05:30-06:30"
        + subnet_group_name              = "mumbai-dev-39e419-elasticachesubnetgroup"
        + tags                           = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-consume-redis"
            + "environment_type" = "dev"
          }
        + tags_all                       = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-consume-redis"
            + "environment_type" = "dev"
          }
        + transit_encryption_enabled     = true
  
        + cluster_mode {
            + num_node_groups         = (known after apply)
            + replicas_per_node_group = (known after apply)
          }
      }
  
    # module.mcmp.aws_elasticache_replication_group.redis["coreplus"] will be created
    + resource "aws_elasticache_replication_group" "redis" {
        + apply_immediately              = (known after apply)
        + arn                            = (known after apply)
        + at_rest_encryption_enabled     = true
        + auth_token                     = (sensitive value)
        + auto_minor_version_upgrade     = true
        + automatic_failover_enabled     = true
        + availability_zones             = [
            + "***a",
            + "***b",
            + "***c",
          ]
        + cluster_enabled                = (known after apply)
        + configuration_endpoint_address = (known after apply)
        + engine                         = "redis"
        + engine_version                 = "6.x"
        + engine_version_actual          = (known after apply)
        + global_replication_group_id    = (known after apply)
        + id                             = (known after apply)
        + maintenance_window             = "sat:10:00-sat:11:00"
        + member_clusters                = (known after apply)
        + multi_az_enabled               = true
        + node_type                      = "cache.r6g.large"
        + number_cache_clusters          = 3
        + parameter_group_name           = "default.redis6.x"
        + port                           = 6379
        + primary_endpoint_address       = (known after apply)
        + reader_endpoint_address        = (known after apply)
        + replication_group_description  = "Hyperscaler Elasticache(Redis)"
        + replication_group_id           = "mumbai-dev-39e419-coreplus-redis"
        + security_group_ids             = (known after apply)
        + security_group_names           = (known after apply)
        + snapshot_retention_limit       = 1
        + snapshot_window                = "05:30-06:30"
        + subnet_group_name              = "mumbai-dev-39e419-elasticachesubnetgroup"
        + tags                           = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-coreplus-redis"
            + "environment_type" = "dev"
          }
        + tags_all                       = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-coreplus-redis"
            + "environment_type" = "dev"
          }
        + transit_encryption_enabled     = true
  
        + cluster_mode {
            + num_node_groups         = (known after apply)
            + replicas_per_node_group = (known after apply)
          }
      }
  
    # module.mcmp.aws_elasticache_subnet_group.group[0] will be created
    + resource "aws_elasticache_subnet_group" "group" {
        + arn         = (known after apply)
        + description = "Managed by Terraform"
        + id          = (known after apply)
        + name        = "mumbai-dev-39e419-elasticachesubnetgroup"
        + subnet_ids  = (known after apply)
        + tags        = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-ElastiCacheSubnetGroup"
            + "environment_type" = "dev"
          }
        + tags_all    = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-ElastiCacheSubnetGroup"
            + "environment_type" = "dev"
          }
      }
  
    # module.mcmp.aws_iam_group.admin will be created
    + resource "aws_iam_group" "admin" {
        + arn       = (known after apply)
        + id        = (known after apply)
        + name      = "mumbai-dev-39e419-k8sAdmin"
        + path      = "/"
        + unique_id = (known after apply)
      }
  
    # module.mcmp.aws_iam_group.viewer will be created
    + resource "aws_iam_group" "viewer" {
        + arn       = (known after apply)
        + id        = (known after apply)
        + name      = "mumbai-dev-39e419-k8sViewer"
        + path      = "/"
        + unique_id = (known after apply)
      }
  
    # module.mcmp.aws_iam_group_policy_attachment.admin will be created
    + resource "aws_iam_group_policy_attachment" "admin" {
        + group      = (known after apply)
        + id         = (known after apply)
        + policy_arn = (known after apply)
      }
  
    # module.mcmp.aws_iam_group_policy_attachment.viewer will be created
    + resource "aws_iam_group_policy_attachment" "viewer" {
        + group      = (known after apply)
        + id         = (known after apply)
        + policy_arn = (known after apply)
      }
  
    # module.mcmp.aws_iam_openid_connect_provider.main will be created
    + resource "aws_iam_openid_connect_provider" "main" {
        + arn             = (known after apply)
        + client_id_list  = [
            + "sts.amazonaws.com",
          ]
        + id              = (known after apply)
        + tags_all        = (known after apply)
        + thumbprint_list = [
            + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
          ]
        + url             = (known after apply)
      }
  
    # module.mcmp.aws_iam_policy.admin will be created
    + resource "aws_iam_policy" "admin" {
        + arn         = (known after apply)
        + description = "Allows to assume k8s admin role"
        + id          = (known after apply)
        + name        = "mumbai-dev-39e419-k8sAdmin"
        + path        = "/"
        + policy      = (known after apply)
        + policy_id   = (known after apply)
        + tags        = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all    = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
      }
  
    # module.mcmp.aws_iam_policy.cluster_autoscaler will be created
    + resource "aws_iam_policy" "cluster_autoscaler" {
        + arn         = (known after apply)
        + description = "Allows to adjust the number of worker nodes in the EKS cluster"
        + id          = (known after apply)
        + name        = "mumbai-dev-39e419-AmazonEKSClusterAutoscalerPolicy"
        + path        = "/"
        + policy      = jsonencode(
              {
                + Statement = [
                    + {
                        + Action   = [
                            + "ec2:DescribeLaunchTemplateVersions",
                            + "autoscaling:TerminateInstanceInAutoScalingGroup",
                            + "autoscaling:SetDesiredCapacity",
                            + "autoscaling:DescribeTags",
                            + "autoscaling:DescribeLaunchConfigurations",
                            + "autoscaling:DescribeAutoScalingInstances",
                            + "autoscaling:DescribeAutoScalingGroups",
                          ]
                        + Effect   = "Allow"
                        + Resource = "*"
                        + Sid      = ""
                      },
                  ]
                + Version   = "2012-10-17"
              }
          )
        + policy_id   = (known after apply)
        + tags        = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all    = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
      }
  
    # module.mcmp.aws_iam_policy.policy will be created
    + resource "aws_iam_policy" "policy" {
        + arn         = (known after apply)
        + description = "mumbai-dev-39e419 AWSLoadBalancerControllerIAMPolicy"
        + id          = (known after apply)
        + name        = "mumbai-dev-39e419-AWSLoadBalancerControllerIAMPolicy"
        + path        = "/"
        + policy      = jsonencode(
              {
                + Statement = [
                    + {
                        + Action   = [
                            + "iam:CreateServiceLinkedRole",
                            + "ec2:DescribeAccountAttributes",
                            + "ec2:DescribeAddresses",
                            + "ec2:DescribeAvailabilityZones",
                            + "ec2:DescribeInternetGateways",
                            + "ec2:DescribeVpcs",
                            + "ec2:DescribeSubnets",
                            + "ec2:DescribeSecurityGroups",
                            + "ec2:DescribeInstances",
                            + "ec2:DescribeNetworkInterfaces",
                            + "ec2:DescribeTags",
                            + "ec2:GetCoipPoolUsage",
                            + "ec2:DescribeCoipPools",
                            + "elasticloadbalancing:DescribeLoadBalancers",
                            + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                            + "elasticloadbalancing:DescribeListeners",
                            + "elasticloadbalancing:DescribeListenerCertificates",
                            + "elasticloadbalancing:DescribeSSLPolicies",
                            + "elasticloadbalancing:DescribeRules",
                            + "elasticloadbalancing:DescribeTargetGroups",
                            + "elasticloadbalancing:DescribeTargetGroupAttributes",
                            + "elasticloadbalancing:DescribeTargetHealth",
                            + "elasticloadbalancing:DescribeTags",
                          ]
                        + Effect   = "Allow"
                        + Resource = "*"
                      },
                    + {
                        + Action   = [
                            + "cognito-idp:DescribeUserPoolClient",
                            + "acm:ListCertificates",
                            + "acm:DescribeCertificate",
                            + "iam:ListServerCertificates",
                            + "iam:GetServerCertificate",
                            + "waf-regional:GetWebACL",
                            + "waf-regional:GetWebACLForResource",
                            + "waf-regional:AssociateWebACL",
                            + "waf-regional:DisassociateWebACL",
                            + "wafv2:GetWebACL",
                            + "wafv2:GetWebACLForResource",
                            + "wafv2:AssociateWebACL",
                            + "wafv2:DisassociateWebACL",
                            + "shield:GetSubscriptionState",
                            + "shield:DescribeProtection",
                            + "shield:CreateProtection",
                            + "shield:DeleteProtection",
                          ]
                        + Effect   = "Allow"
                        + Resource = "*"
                      },
                    + {
                        + Action   = [
                            + "ec2:AuthorizeSecurityGroupIngress",
                            + "ec2:RevokeSecurityGroupIngress",
                          ]
                        + Effect   = "Allow"
                        + Resource = "*"
                      },
                    + {
                        + Action   = [
                            + "ec2:CreateSecurityGroup",
                          ]
                        + Effect   = "Allow"
                        + Resource = "*"
                      },
                    + {
                        + Action    = [
                            + "ec2:CreateTags",
                          ]
                        + Condition = {
                            + Null         = {
                                + aws:RequestTag/elbv2.k8s.aws/cluster = "false"
                              }
                            + StringEquals = {
                                + ec2:CreateAction = "CreateSecurityGroup"
                              }
                          }
                        + Effect    = "Allow"
                        + Resource  = "arn:aws:ec2:*:*:security-group/*"
                      },
                    + {
                        + Action    = [
                            + "ec2:CreateTags",
                            + "ec2:DeleteTags",
                          ]
                        + Condition = {
                            + Null = {
                                + aws:RequestTag/elbv2.k8s.aws/cluster  = "true"
                                + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                              }
                          }
                        + Effect    = "Allow"
                        + Resource  = "arn:aws:ec2:*:*:security-group/*"
                      },
                    + {
                        + Action    = [
                            + "ec2:AuthorizeSecurityGroupIngress",
                            + "ec2:RevokeSecurityGroupIngress",
                            + "ec2:DeleteSecurityGroup",
                          ]
                        + Condition = {
                            + Null = {
                                + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                              }
                          }
                        + Effect    = "Allow"
                        + Resource  = "*"
                      },
                    + {
                        + Action    = [
                            + "elasticloadbalancing:CreateLoadBalancer",
                            + "elasticloadbalancing:CreateTargetGroup",
                          ]
                        + Condition = {
                            + Null = {
                                + aws:RequestTag/elbv2.k8s.aws/cluster = "false"
                              }
                          }
                        + Effect    = "Allow"
                        + Resource  = "*"
                      },
                    + {
                        + Action   = [
                            + "elasticloadbalancing:CreateListener",
                            + "elasticloadbalancing:DeleteListener",
                            + "elasticloadbalancing:CreateRule",
                            + "elasticloadbalancing:DeleteRule",
                          ]
                        + Effect   = "Allow"
                        + Resource = "*"
                      },
                    + {
                        + Action    = [
                            + "elasticloadbalancing:AddTags",
                            + "elasticloadbalancing:RemoveTags",
                          ]
                        + Condition = {
                            + Null = {
                                + aws:RequestTag/elbv2.k8s.aws/cluster  = "true"
                                + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                              }
                          }
                        + Effect    = "Allow"
                        + Resource  = [
                            + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                            + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                            + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                          ]
                      },
                    + {
                        + Action   = [
                            + "elasticloadbalancing:AddTags",
                            + "elasticloadbalancing:RemoveTags",
                          ]
                        + Effect   = "Allow"
                        + Resource = [
                            + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                            + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                            + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                            + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                          ]
                      },
                    + {
                        + Action    = [
                            + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                            + "elasticloadbalancing:SetIpAddressType",
                            + "elasticloadbalancing:SetSecurityGroups",
                            + "elasticloadbalancing:SetSubnets",
                            + "elasticloadbalancing:DeleteLoadBalancer",
                            + "elasticloadbalancing:ModifyTargetGroup",
                            + "elasticloadbalancing:ModifyTargetGroupAttributes",
                            + "elasticloadbalancing:DeleteTargetGroup",
                          ]
                        + Condition = {
                            + Null = {
                                + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                              }
                          }
                        + Effect    = "Allow"
                        + Resource  = "*"
                      },
                    + {
                        + Action   = [
                            + "elasticloadbalancing:RegisterTargets",
                            + "elasticloadbalancing:DeregisterTargets",
                          ]
                        + Effect   = "Allow"
                        + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                      },
                    + {
                        + Action   = [
                            + "elasticloadbalancing:SetWebAcl",
                            + "elasticloadbalancing:ModifyListener",
                            + "elasticloadbalancing:AddListenerCertificates",
                            + "elasticloadbalancing:RemoveListenerCertificates",
                            + "elasticloadbalancing:ModifyRule",
                          ]
                        + Effect   = "Allow"
                        + Resource = "*"
                      },
                  ]
                + Version   = "2012-10-17"
              }
          )
        + policy_id   = (known after apply)
        + tags_all    = (known after apply)
      }
  
    # module.mcmp.aws_iam_policy.view_eks_clusters will be created
    + resource "aws_iam_policy" "view_eks_clusters" {
        + arn         = (known after apply)
        + description = "Allows to view nodes and workflows in the EKS cluster"
        + id          = (known after apply)
        + name        = "mumbai-dev-39e419-AmazonEKSClusterViewPolicy"
        + path        = "/"
        + policy      = jsonencode(
              {
                + Statement = [
                    + {
                        + Action   = [
                            + "ssm:GetParameter",
                            + "iam:ListRoles",
                            + "eks:ListUpdates",
                            + "eks:ListNodegroups",
                            + "eks:ListIdentityProviderConfigs",
                            + "eks:ListFargateProfiles",
                            + "eks:ListClusters",
                            + "eks:ListAddons",
                            + "eks:DescribeNodegroup",
                            + "eks:DescribeCluster",
                            + "eks:DescribeAddonVersions",
                            + "eks:AccessKubernetesApi",
                          ]
                        + Effect   = "Allow"
                        + Resource = "*"
                        + Sid      = ""
                      },
                  ]
                + Version   = "2012-10-17"
              }
          )
        + policy_id   = (known after apply)
        + tags        = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all    = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
      }
  
    # module.mcmp.aws_iam_policy.viewer will be created
    + resource "aws_iam_policy" "viewer" {
        + arn         = (known after apply)
        + description = "Allows to assume k8s viewer role"
        + id          = (known after apply)
        + name        = "mumbai-dev-39e419-k8sViewer"
        + path        = "/"
        + policy      = (known after apply)
        + policy_id   = (known after apply)
        + tags        = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all    = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
      }
  
    # module.mcmp.aws_iam_policy_attachment.alb will be created
    + resource "aws_iam_policy_attachment" "alb" {
        + id         = (known after apply)
        + name       = "mumbai-dev-39e419-alb"
        + policy_arn = (known after apply)
        + roles      = (known after apply)
      }
  
    # module.mcmp.aws_iam_role.admin will be created
    + resource "aws_iam_role" "admin" {
        + arn                   = (known after apply)
        + assume_role_policy    = jsonencode(
              {
                + Statement = [
                    + {
                        + Action    = "sts:AssumeRole"
                        + Effect    = "Allow"
                        + Principal = {
                            + AWS = "arn:aws:iam::794296633202:root"
                          }
                      },
                  ]
                + Version   = "2012-10-17"
              }
          )
        + create_date           = (known after apply)
        + description           = "Provides administrator privileges to the EKS cluster"
        + force_detach_policies = false
        + id                    = (known after apply)
        + managed_policy_arns   = (known after apply)
        + max_session_duration  = 3600
        + name                  = "mumbai-dev-39e419-k8sAdmin"
        + path                  = "/"
        + tags                  = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all              = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + unique_id             = (known after apply)
  
        + inline_policy {
            + name   = (known after apply)
            + policy = (known after apply)
          }
      }
  
    # module.mcmp.aws_iam_role.alb will be created
    + resource "aws_iam_role" "alb" {
        + arn                   = (known after apply)
        + assume_role_policy    = (known after apply)
        + create_date           = (known after apply)
        + description           = "Create an IAM role for AWS Load balancer Controller"
        + force_detach_policies = false
        + id                    = (known after apply)
        + managed_policy_arns   = (known after apply)
        + max_session_duration  = 3600
        + name                  = "mumbai-dev-39e419-AmazonEKSLoadBalancerControllerRole"
        + path                  = "/"
        + tags                  = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all              = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + unique_id             = (known after apply)
  
        + inline_policy {
            + name   = (known after apply)
            + policy = (known after apply)
          }
      }
  
    # module.mcmp.aws_iam_role.cluster_autoscaler will be created
    + resource "aws_iam_role" "cluster_autoscaler" {
        + arn                   = (known after apply)
        + assume_role_policy    = (known after apply)
        + create_date           = (known after apply)
        + description           = "Allows to adjust the number of worker nodes in the EKS cluster"
        + force_detach_policies = false
        + id                    = (known after apply)
        + managed_policy_arns   = (known after apply)
        + max_session_duration  = 3600
        + name                  = "mumbai-dev-39e419-AmazonEKSClusterAutoscalerRole"
        + path                  = "/"
        + tags                  = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all              = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + unique_id             = (known after apply)
  
        + inline_policy {
            + name   = (known after apply)
            + policy = (known after apply)
          }
      }
  
    # module.mcmp.aws_iam_role.eks will be created
    + resource "aws_iam_role" "eks" {
        + arn                   = (known after apply)
        + assume_role_policy    = jsonencode(
              {
                + Statement = [
                    + {
                        + Action    = "sts:AssumeRole"
                        + Effect    = "Allow"
                        + Principal = {
                            + Service = "eks.amazonaws.com"
                          }
                      },
                  ]
                + Version   = "2012-10-17"
              }
          )
        + create_date           = (known after apply)
        + description           = "Allows access to other AWS service resources that are required by EKS cluster"
        + force_detach_policies = false
        + id                    = (known after apply)
        + managed_policy_arns   = (known after apply)
        + max_session_duration  = 3600
        + name                  = "mumbai-dev-39e419-EKSClusterRole"
        + path                  = "/"
        + tags                  = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all              = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + unique_id             = (known after apply)
  
        + inline_policy {
            + name   = (known after apply)
            + policy = (known after apply)
          }
      }
  
    # module.mcmp.aws_iam_role.nodes will be created
    + resource "aws_iam_role" "nodes" {
        + arn                   = (known after apply)
        + assume_role_policy    = jsonencode(
              {
                + Statement = [
                    + {
                        + Action    = "sts:AssumeRole"
                        + Effect    = "Allow"
                        + Principal = {
                            + Service = "ec2.amazonaws.com"
                          }
                      },
                  ]
                + Version   = "2012-10-17"
              }
          )
        + create_date           = (known after apply)
        + description           = "Allows access to other AWS service resources that are required by EKS worker nodes"
        + force_detach_policies = false
        + id                    = (known after apply)
        + managed_policy_arns   = (known after apply)
        + max_session_duration  = 3600
        + name                  = "mumbai-dev-39e419-EKSNodeRole"
        + path                  = "/"
        + tags                  = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all              = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + unique_id             = (known after apply)
  
        + inline_policy {
            + name   = (known after apply)
            + policy = (known after apply)
          }
      }
  
    # module.mcmp.aws_iam_role.viewer will be created
    + resource "aws_iam_role" "viewer" {
        + arn                   = (known after apply)
        + assume_role_policy    = jsonencode(
              {
                + Statement = [
                    + {
                        + Action    = "sts:AssumeRole"
                        + Effect    = "Allow"
                        + Principal = {
                            + AWS = "arn:aws:iam::794296633202:root"
                          }
                      },
                  ]
                + Version   = "2012-10-17"
              }
          )
        + create_date           = (known after apply)
        + description           = "Provides view privileges to the EKS cluster"
        + force_detach_policies = false
        + id                    = (known after apply)
        + managed_policy_arns   = (known after apply)
        + max_session_duration  = 3600
        + name                  = "mumbai-dev-39e419-k8sViewer"
        + path                  = "/"
        + tags                  = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all              = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + unique_id             = (known after apply)
  
        + inline_policy {
            + name   = (known after apply)
            + policy = (known after apply)
          }
      }
  
    # module.mcmp.aws_iam_role_policy_attachment.admin will be created
    + resource "aws_iam_role_policy_attachment" "admin" {
        + id         = (known after apply)
        + policy_arn = (known after apply)
        + role       = "mumbai-dev-39e419-k8sAdmin"
      }
  
    # module.mcmp.aws_iam_role_policy_attachment.cluster_autoscaler will be created
    + resource "aws_iam_role_policy_attachment" "cluster_autoscaler" {
        + id         = (known after apply)
        + policy_arn = (known after apply)
        + role       = "mumbai-dev-39e419-AmazonEKSClusterAutoscalerRole"
      }
  
    # module.mcmp.aws_iam_role_policy_attachment.eks will be created
    + resource "aws_iam_role_policy_attachment" "eks" {
        + id         = (known after apply)
        + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
        + role       = "mumbai-dev-39e419-EKSClusterRole"
      }
  
    # module.mcmp.aws_iam_role_policy_attachment.eks_service will be created
    + resource "aws_iam_role_policy_attachment" "eks_service" {
        + id         = (known after apply)
        + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
        + role       = "mumbai-dev-39e419-EKSClusterRole"
      }
  
    # module.mcmp.aws_iam_role_policy_attachment.eks_vpc will be created
    + resource "aws_iam_role_policy_attachment" "eks_vpc" {
        + id         = (known after apply)
        + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
        + role       = "mumbai-dev-39e419-EKSClusterRole"
      }
  
    # module.mcmp.aws_iam_role_policy_attachment.nodes will be created
    + resource "aws_iam_role_policy_attachment" "nodes" {
        + id         = (known after apply)
        + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
        + role       = "mumbai-dev-39e419-EKSNodeRole"
      }
  
    # module.mcmp.aws_iam_role_policy_attachment.nodes_cni will be created
    + resource "aws_iam_role_policy_attachment" "nodes_cni" {
        + id         = (known after apply)
        + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
        + role       = "mumbai-dev-39e419-EKSNodeRole"
      }
  
    # module.mcmp.aws_iam_role_policy_attachment.nodes_ecr will be created
    + resource "aws_iam_role_policy_attachment" "nodes_ecr" {
        + id         = (known after apply)
        + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
        + role       = "mumbai-dev-39e419-EKSNodeRole"
      }
  
    # module.mcmp.aws_iam_role_policy_attachment.viewer will be created
    + resource "aws_iam_role_policy_attachment" "viewer" {
        + id         = (known after apply)
        + policy_arn = (known after apply)
        + role       = "mumbai-dev-39e419-k8sViewer"
      }
  
    # module.mcmp.aws_internet_gateway.public will be created
    + resource "aws_internet_gateway" "public" {
        + arn      = (known after apply)
        + id       = (known after apply)
        + owner_id = (known after apply)
        + tags     = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419"
            + "environment_type" = "dev"
          }
        + tags_all = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419"
            + "environment_type" = "dev"
          }
        + vpc_id   = (known after apply)
      }
  
    # module.mcmp.aws_nat_gateway.private will be created
    + resource "aws_nat_gateway" "private" {
        + allocation_id        = (known after apply)
        + connectivity_type    = "public"
        + id                   = (known after apply)
        + network_interface_id = (known after apply)
        + private_ip           = (known after apply)
        + public_ip            = (known after apply)
        + subnet_id            = (known after apply)
        + tags                 = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419"
            + "environment_type" = "dev"
          }
        + tags_all             = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419"
            + "environment_type" = "dev"
          }
      }
  
    # module.mcmp.aws_route.peer[0] will be created
    + resource "aws_route" "peer" {
        + destination_cidr_block    = (known after apply)
        + id                        = (known after apply)
        + instance_id               = (known after apply)
        + instance_owner_id         = (known after apply)
        + network_interface_id      = (known after apply)
        + origin                    = (known after apply)
        + route_table_id            = (known after apply)
        + state                     = (known after apply)
        + vpc_peering_connection_id = (known after apply)
      }
  
    # module.mcmp.aws_route.private will be created
    + resource "aws_route" "private" {
        + destination_cidr_block = "0.0.0.0/0"
        + id                     = (known after apply)
        + instance_id            = (known after apply)
        + instance_owner_id      = (known after apply)
        + nat_gateway_id         = (known after apply)
        + network_interface_id   = (known after apply)
        + origin                 = (known after apply)
        + route_table_id         = (known after apply)
        + state                  = (known after apply)
      }
  
    # module.mcmp.aws_route.public will be created
    + resource "aws_route" "public" {
        + destination_cidr_block = "0.0.0.0/0"
        + gateway_id             = (known after apply)
        + id                     = (known after apply)
        + instance_id            = (known after apply)
        + instance_owner_id      = (known after apply)
        + network_interface_id   = (known after apply)
        + origin                 = (known after apply)
        + route_table_id         = (known after apply)
        + state                  = (known after apply)
      }
  
    # module.mcmp.aws_route_table.private will be created
    + resource "aws_route_table" "private" {
        + arn              = (known after apply)
        + id               = (known after apply)
        + owner_id         = (known after apply)
        + propagating_vgws = (known after apply)
        + route            = (known after apply)
        + tags             = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-private"
            + "environment_type" = "dev"
          }
        + tags_all         = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-private"
            + "environment_type" = "dev"
          }
        + vpc_id           = (known after apply)
      }
  
    # module.mcmp.aws_route_table.public will be created
    + resource "aws_route_table" "public" {
        + arn              = (known after apply)
        + id               = (known after apply)
        + owner_id         = (known after apply)
        + propagating_vgws = (known after apply)
        + route            = (known after apply)
        + tags             = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-public"
            + "environment_type" = "dev"
          }
        + tags_all         = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-public"
            + "environment_type" = "dev"
          }
        + vpc_id           = (known after apply)
      }
  
    # module.mcmp.aws_route_table_association.private[0] will be created
    + resource "aws_route_table_association" "private" {
        + id             = (known after apply)
        + route_table_id = (known after apply)
        + subnet_id      = (known after apply)
      }
  
    # module.mcmp.aws_route_table_association.private[1] will be created
    + resource "aws_route_table_association" "private" {
        + id             = (known after apply)
        + route_table_id = (known after apply)
        + subnet_id      = (known after apply)
      }
  
    # module.mcmp.aws_route_table_association.private[2] will be created
    + resource "aws_route_table_association" "private" {
        + id             = (known after apply)
        + route_table_id = (known after apply)
        + subnet_id      = (known after apply)
      }
  
    # module.mcmp.aws_route_table_association.public[0] will be created
    + resource "aws_route_table_association" "public" {
        + id             = (known after apply)
        + route_table_id = (known after apply)
        + subnet_id      = (known after apply)
      }
  
    # module.mcmp.aws_route_table_association.public[1] will be created
    + resource "aws_route_table_association" "public" {
        + id             = (known after apply)
        + route_table_id = (known after apply)
        + subnet_id      = (known after apply)
      }
  
    # module.mcmp.aws_route_table_association.public[2] will be created
    + resource "aws_route_table_association" "public" {
        + id             = (known after apply)
        + route_table_id = (known after apply)
        + subnet_id      = (known after apply)
      }
  
    # module.mcmp.aws_s3_bucket.s3["mcmp"] will be created
    + resource "aws_s3_bucket" "s3" {
        + acceleration_status         = (known after apply)
        + acl                         = "private"
        + arn                         = (known after apply)
        + bucket                      = "mumbai-dev-39e419-mcmp"
        + bucket_domain_name          = (known after apply)
        + bucket_regional_domain_name = (known after apply)
        + force_destroy               = false
        + hosted_zone_id              = (known after apply)
        + id                          = (known after apply)
        + region                      = (known after apply)
        + request_payer               = (known after apply)
        + tags                        = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all                    = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + website_domain              = (known after apply)
        + website_endpoint            = (known after apply)
  
        + versioning {
            + enabled    = false
            + mfa_delete = false
          }
      }
  
    # module.mcmp.aws_s3_bucket.s3["vault"] will be created
    + resource "aws_s3_bucket" "s3" {
        + acceleration_status         = (known after apply)
        + acl                         = "private"
        + arn                         = (known after apply)
        + bucket                      = "mumbai-dev-39e419-vault"
        + bucket_domain_name          = (known after apply)
        + bucket_regional_domain_name = (known after apply)
        + force_destroy               = false
        + hosted_zone_id              = (known after apply)
        + id                          = (known after apply)
        + region                      = (known after apply)
        + request_payer               = (known after apply)
        + tags                        = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all                    = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + website_domain              = (known after apply)
        + website_endpoint            = (known after apply)
  
        + versioning {
            + enabled    = false
            + mfa_delete = false
          }
      }
  
    # module.mcmp.aws_security_group.main will be created
    + resource "aws_security_group" "main" {
        + arn                    = (known after apply)
        + description            = "Managed by Terraform"
        + egress                 = [
            + {
                + cidr_blocks      = [
                    + "0.0.0.0/0",
                  ]
                + description      = "Ingress rules for port 443"
                + from_port        = 443
                + ipv6_cidr_blocks = []
                + prefix_list_ids  = []
                + protocol         = "tcp"
                + security_groups  = []
                + self             = false
                + to_port          = 443
              },
          ]
        + id                     = (known after apply)
        + ingress                = [
            + {
                + cidr_blocks      = [
                    + "172.16.0.0/16",
                  ]
                + description      = "Ingress rules for port elastic cache"
                + from_port        = 6379
                + ipv6_cidr_blocks = []
                + prefix_list_ids  = []
                + protocol         = "tcp"
                + security_groups  = []
                + self             = false
                + to_port          = 6379
              },
          ]
        + name                   = "resource_with_dynamic_block"
        + name_prefix            = (known after apply)
        + owner_id               = (known after apply)
        + revoke_rules_on_delete = false
        + tags                   = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + tags_all               = {
            + "Environment"      = "dev"
            + "environment_type" = "dev"
          }
        + vpc_id                 = (known after apply)
      }
  
    # module.mcmp.aws_subnet.private[0] will be created
    + resource "aws_subnet" "private" {
        + arn                             = (known after apply)
        + assign_ipv6_address_on_creation = false
        + availability_zone               = "***a"
        + availability_zone_id            = (known after apply)
        + cidr_block                      = "172.16.1.0/24"
        + id                              = (known after apply)
        + ipv6_cidr_block_association_id  = (known after apply)
        + map_public_ip_on_launch         = false
        + owner_id                        = (known after apply)
        + tags                            = {
            + "Environment"                             = "dev"
            + "Name"                                    = "mumbai-dev-39e419-private-0"
            + "environment_type"                        = "dev"
            + "kubernetes.io/cluster/mumbai-dev-39e419" = "shared"
            + "kubernetes.io/role/internal-elb"         = "1"
          }
        + tags_all                        = {
            + "Environment"                             = "dev"
            + "Name"                                    = "mumbai-dev-39e419-private-0"
            + "environment_type"                        = "dev"
            + "kubernetes.io/cluster/mumbai-dev-39e419" = "shared"
            + "kubernetes.io/role/internal-elb"         = "1"
          }
        + vpc_id                          = (known after apply)
      }
  
    # module.mcmp.aws_subnet.private[1] will be created
    + resource "aws_subnet" "private" {
        + arn                             = (known after apply)
        + assign_ipv6_address_on_creation = false
        + availability_zone               = "***b"
        + availability_zone_id            = (known after apply)
        + cidr_block                      = "172.16.2.0/24"
        + id                              = (known after apply)
        + ipv6_cidr_block_association_id  = (known after apply)
        + map_public_ip_on_launch         = false
        + owner_id                        = (known after apply)
        + tags                            = {
            + "Environment"                             = "dev"
            + "Name"                                    = "mumbai-dev-39e419-private-1"
            + "environment_type"                        = "dev"
            + "kubernetes.io/cluster/mumbai-dev-39e419" = "shared"
            + "kubernetes.io/role/internal-elb"         = "1"
          }
        + tags_all                        = {
            + "Environment"                             = "dev"
            + "Name"                                    = "mumbai-dev-39e419-private-1"
            + "environment_type"                        = "dev"
            + "kubernetes.io/cluster/mumbai-dev-39e419" = "shared"
            + "kubernetes.io/role/internal-elb"         = "1"
          }
        + vpc_id                          = (known after apply)
      }
  
    # module.mcmp.aws_subnet.private[2] will be created
    + resource "aws_subnet" "private" {
        + arn                             = (known after apply)
        + assign_ipv6_address_on_creation = false
        + availability_zone               = "***c"
        + availability_zone_id            = (known after apply)
        + cidr_block                      = "172.16.3.0/24"
        + id                              = (known after apply)
        + ipv6_cidr_block_association_id  = (known after apply)
        + map_public_ip_on_launch         = false
        + owner_id                        = (known after apply)
        + tags                            = {
            + "Environment"                             = "dev"
            + "Name"                                    = "mumbai-dev-39e419-private-2"
            + "environment_type"                        = "dev"
            + "kubernetes.io/cluster/mumbai-dev-39e419" = "shared"
            + "kubernetes.io/role/internal-elb"         = "1"
          }
        + tags_all                        = {
            + "Environment"                             = "dev"
            + "Name"                                    = "mumbai-dev-39e419-private-2"
            + "environment_type"                        = "dev"
            + "kubernetes.io/cluster/mumbai-dev-39e419" = "shared"
            + "kubernetes.io/role/internal-elb"         = "1"
          }
        + vpc_id                          = (known after apply)
      }
  
    # module.mcmp.aws_subnet.public[0] will be created
    + resource "aws_subnet" "public" {
        + arn                             = (known after apply)
        + assign_ipv6_address_on_creation = false
        + availability_zone               = "***a"
        + availability_zone_id            = (known after apply)
        + cidr_block                      = "172.16.101.0/24"
        + id                              = (known after apply)
        + ipv6_cidr_block_association_id  = (known after apply)
        + map_public_ip_on_launch         = true
        + owner_id                        = (known after apply)
        + tags                            = {
            + "Environment"                             = "dev"
            + "Name"                                    = "mumbai-dev-39e419-public-0"
            + "environment_type"                        = "dev"
            + "kubernetes.io/cluster/mumbai-dev-39e419" = "shared"
            + "kubernetes.io/role/elb"                  = "1"
          }
        + tags_all                        = {
            + "Environment"                             = "dev"
            + "Name"                                    = "mumbai-dev-39e419-public-0"
            + "environment_type"                        = "dev"
            + "kubernetes.io/cluster/mumbai-dev-39e419" = "shared"
            + "kubernetes.io/role/elb"                  = "1"
          }
        + vpc_id                          = (known after apply)
      }
  
    # module.mcmp.aws_subnet.public[1] will be created
    + resource "aws_subnet" "public" {
        + arn                             = (known after apply)
        + assign_ipv6_address_on_creation = false
        + availability_zone               = "***b"
        + availability_zone_id            = (known after apply)
        + cidr_block                      = "172.16.102.0/24"
        + id                              = (known after apply)
        + ipv6_cidr_block_association_id  = (known after apply)
        + map_public_ip_on_launch         = true
        + owner_id                        = (known after apply)
        + tags                            = {
            + "Environment"                             = "dev"
            + "Name"                                    = "mumbai-dev-39e419-public-1"
            + "environment_type"                        = "dev"
            + "kubernetes.io/cluster/mumbai-dev-39e419" = "shared"
            + "kubernetes.io/role/elb"                  = "1"
          }
        + tags_all                        = {
            + "Environment"                             = "dev"
            + "Name"                                    = "mumbai-dev-39e419-public-1"
            + "environment_type"                        = "dev"
            + "kubernetes.io/cluster/mumbai-dev-39e419" = "shared"
            + "kubernetes.io/role/elb"                  = "1"
          }
        + vpc_id                          = (known after apply)
      }
  
    # module.mcmp.aws_subnet.public[2] will be created
    + resource "aws_subnet" "public" {
        + arn                             = (known after apply)
        + assign_ipv6_address_on_creation = false
        + availability_zone               = "***c"
        + availability_zone_id            = (known after apply)
        + cidr_block                      = "172.16.103.0/24"
        + id                              = (known after apply)
        + ipv6_cidr_block_association_id  = (known after apply)
        + map_public_ip_on_launch         = true
        + owner_id                        = (known after apply)
        + tags                            = {
            + "Environment"                             = "dev"
            + "Name"                                    = "mumbai-dev-39e419-public-2"
            + "environment_type"                        = "dev"
            + "kubernetes.io/cluster/mumbai-dev-39e419" = "shared"
            + "kubernetes.io/role/elb"                  = "1"
          }
        + tags_all                        = {
            + "Environment"                             = "dev"
            + "Name"                                    = "mumbai-dev-39e419-public-2"
            + "environment_type"                        = "dev"
            + "kubernetes.io/cluster/mumbai-dev-39e419" = "shared"
            + "kubernetes.io/role/elb"                  = "1"
          }
        + vpc_id                          = (known after apply)
      }
  
    # module.mcmp.aws_vpc.main will be created
    + resource "aws_vpc" "main" {
        + arn                              = (known after apply)
        + assign_generated_ipv6_cidr_block = false
        + cidr_block                       = "172.16.0.0/16"
        + default_network_acl_id           = (known after apply)
        + default_route_table_id           = (known after apply)
        + default_security_group_id        = (known after apply)
        + dhcp_options_id                  = (known after apply)
        + enable_classiclink               = (known after apply)
        + enable_classiclink_dns_support   = (known after apply)
        + enable_dns_hostnames             = true
        + enable_dns_support               = true
        + id                               = (known after apply)
        + instance_tenancy                 = "default"
        + ipv6_association_id              = (known after apply)
        + ipv6_cidr_block                  = (known after apply)
        + main_route_table_id              = (known after apply)
        + owner_id                         = (known after apply)
        + tags                             = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419"
            + "environment_type" = "dev"
          }
        + tags_all                         = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419"
            + "environment_type" = "dev"
          }
      }
  
    # module.mcmp.aws_vpc_peering_connection_accepter.peer[0] will be created
    + resource "aws_vpc_peering_connection_accepter" "peer" {
        + accept_status             = (known after apply)
        + auto_accept               = true
        + id                        = (known after apply)
        + peer_owner_id             = (known after apply)
        + peer_region               = (known after apply)
        + peer_vpc_id               = (known after apply)
        + tags                      = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419"
            + "environment_type" = "dev"
          }
        + tags_all                  = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419"
            + "environment_type" = "dev"
          }
        + vpc_id                    = (known after apply)
        + vpc_peering_connection_id = (known after apply)
  
        + accepter {
            + allow_classic_link_to_remote_vpc = (known after apply)
            + allow_remote_vpc_dns_resolution  = (known after apply)
            + allow_vpc_to_remote_classic_link = (known after apply)
          }
  
        + requester {
            + allow_classic_link_to_remote_vpc = (known after apply)
            + allow_remote_vpc_dns_resolution  = (known after apply)
            + allow_vpc_to_remote_classic_link = (known after apply)
          }
      }
  
    # module.mcmp.helm_release.alb will be created
    + resource "helm_release" "alb" {
        + atomic                     = false
        + chart                      = "modules/aws-mcmp/charts/aws-load-balancer-controller-1.2.6.tgz"
        + cleanup_on_fail            = false
        + create_namespace           = false
        + dependency_update          = false
        + disable_crd_hooks          = false
        + disable_openapi_validation = false
        + disable_webhooks           = false
        + force_update               = false
        + id                         = (known after apply)
        + lint                       = false
        + manifest                   = (known after apply)
        + max_history                = 0
        + metadata                   = (known after apply)
        + name                       = "alb"
        + namespace                  = "kube-system"
        + recreate_pods              = false
        + render_subchart_notes      = true
        + replace                    = false
        + repository                 = "local-charts"
        + reset_values               = false
        + reuse_values               = false
        + skip_crds                  = false
        + status                     = "deployed"
        + timeout                    = 300
        + verify                     = false
        + version                    = "1.2.6"
        + wait                       = true
        + wait_for_jobs              = false
  
        + set {
            + name  = "clusterName"
            + type  = "string"
            + value = "mumbai-dev-39e419"
          }
        + set {
            + name  = "serviceAccount.create"
            + value = "false"
          }
        + set {
            + name  = "serviceAccount.name"
            + type  = "string"
            + value = "aws-load-balancer-controller"
          }
      }
  
    # module.mcmp.kubernetes_cluster_role.cluster_autoscaler will be created
    + resource "kubernetes_cluster_role" "cluster_autoscaler" {
        + id = (known after apply)
  
        + metadata {
            + generation       = (known after apply)
            + labels           = {
                + "k8s-addon" = "cluster-autoscaler.addons.k8s.io"
                + "k8s-app"   = "cluster-autoscaler"
              }
            + name             = "cluster-autoscaler"
            + resource_version = (known after apply)
            + uid              = (known after apply)
          }
  
        + rule {
            + api_groups = [
                + "",
              ]
            + resources  = [
                + "events",
                + "endpoints",
              ]
            + verbs      = [
                + "create",
                + "patch",
              ]
          }
        + rule {
            + api_groups = [
                + "",
              ]
            + resources  = [
                + "pods/eviction",
              ]
            + verbs      = [
                + "create",
              ]
          }
        + rule {
            + api_groups = [
                + "",
              ]
            + resources  = [
                + "pods/status",
              ]
            + verbs      = [
                + "update",
              ]
          }
        + rule {
            + api_groups     = [
                + "",
              ]
            + resource_names = [
                + "cluster-autoscaler",
              ]
            + resources      = [
                + "endpoints",
              ]
            + verbs          = [
                + "get",
                + "update",
              ]
          }
        + rule {
            + api_groups = [
                + "",
              ]
            + resources  = [
                + "nodes",
              ]
            + verbs      = [
                + "watch",
                + "list",
                + "get",
                + "update",
              ]
          }
        + rule {
            + api_groups = [
                + "",
              ]
            + resources  = [
                + "pods",
                + "services",
                + "replicationcontrollers",
                + "persistentvolumeclaims",
                + "persistentvolumes",
              ]
            + verbs      = [
                + "watch",
                + "list",
                + "get",
              ]
          }
        + rule {
            + api_groups = [
                + "extensions",
              ]
            + resources  = [
                + "replicasets",
                + "daemonsets",
              ]
            + verbs      = [
                + "watch",
                + "list",
                + "get",
              ]
          }
        + rule {
            + api_groups = [
                + "policy",
              ]
            + resources  = [
                + "poddisruptionbudgets",
              ]
            + verbs      = [
                + "watch",
                + "list",
              ]
          }
        + rule {
            + api_groups = [
                + "apps",
              ]
            + resources  = [
                + "statefulsets",
                + "replicasets",
                + "daemonsets",
              ]
            + verbs      = [
                + "watch",
                + "list",
                + "get",
              ]
          }
        + rule {
            + api_groups = [
                + "storage.k8s.io",
              ]
            + resources  = [
                + "storageclasses",
                + "csinodes",
              ]
            + verbs      = [
                + "watch",
                + "list",
                + "get",
              ]
          }
        + rule {
            + api_groups = [
                + "batch",
                + "extensions",
              ]
            + resources  = [
                + "jobs",
              ]
            + verbs      = [
                + "get",
                + "list",
                + "watch",
                + "patch",
              ]
          }
        + rule {
            + api_groups = [
                + "coordination.k8s.io",
              ]
            + resources  = [
                + "leases",
              ]
            + verbs      = [
                + "create",
              ]
          }
        + rule {
            + api_groups     = [
                + "coordination.k8s.io",
              ]
            + resource_names = [
                + "cluster-autoscaler",
              ]
            + resources      = [
                + "leases",
              ]
            + verbs          = [
                + "get",
                + "update",
              ]
          }
      }
  
    # module.mcmp.kubernetes_cluster_role_binding.cluster_autoscaler will be created
    + resource "kubernetes_cluster_role_binding" "cluster_autoscaler" {
        + id = (known after apply)
  
        + metadata {
            + generation       = (known after apply)
            + labels           = {
                + "k8s-addon" = "cluster-autoscaler.addons.k8s.io"
                + "k8s-app"   = "cluster-autoscaler"
              }
            + name             = "cluster-autoscaler"
            + resource_version = (known after apply)
            + uid              = (known after apply)
          }
  
        + role_ref {
            + api_group = "rbac.authorization.k8s.io"
            + kind      = "ClusterRole"
            + name      = "cluster-autoscaler"
          }
  
        + subject {
            + api_group = (known after apply)
            + kind      = "ServiceAccount"
            + name      = "cluster-autoscaler"
            + namespace = "kube-system"
          }
      }
  
    # module.mcmp.kubernetes_cluster_role_binding.viewer will be created
    + resource "kubernetes_cluster_role_binding" "viewer" {
        + id = (known after apply)
  
        + metadata {
            + generation       = (known after apply)
            + labels           = {
                + "managed-by" = "terraform"
              }
            + name             = "cluster-viewer"
            + resource_version = (known after apply)
            + uid              = (known after apply)
          }
  
        + role_ref {
            + api_group = "rbac.authorization.k8s.io"
            + kind      = "ClusterRole"
            + name      = "view"
          }
  
        + subject {
            + api_group = "rbac.authorization.k8s.io"
            + kind      = "Group"
            + name      = "system:viewers"
          }
      }
  
    # module.mcmp.kubernetes_config_map.aws_auth will be created
    + resource "kubernetes_config_map" "aws_auth" {
        + data = (known after apply)
        + id   = (known after apply)
  
        + metadata {
            + generation       = (known after apply)
            + labels           = {
                + "managed-by" = "terraform"
              }
            + name             = "aws-auth"
            + namespace        = "kube-system"
            + resource_version = (known after apply)
            + uid              = (known after apply)
          }
      }
  
    # module.mcmp.kubernetes_deployment.cluster_autoscaler will be created
    + resource "kubernetes_deployment" "cluster_autoscaler" {
        + id               = (known after apply)
        + wait_for_rollout = true
  
        + metadata {
            + annotations      = {
                + "cluster-autoscaler.kubernetes.io/safe-to-evict" = "false"
              }
            + generation       = (known after apply)
            + labels           = {
                + "app" = "cluster-autoscaler"
              }
            + name             = "cluster-autoscaler"
            + namespace        = "kube-system"
            + resource_version = (known after apply)
            + uid              = (known after apply)
          }
  
        + spec {
            + min_ready_seconds         = 0
            + paused                    = false
            + progress_deadline_seconds = 600
            + replicas                  = "1"
            + revision_history_limit    = 10
  
            + selector {
                + match_labels = {
                    + "app" = "cluster-autoscaler"
                  }
              }
  
            + strategy {
                + type = (known after apply)
  
                + rolling_update {
                    + max_surge       = (known after apply)
                    + max_unavailable = (known after apply)
                  }
              }
  
            + template {
                + metadata {
                    + annotations      = {
                        + "prometheus.io/port"   = "8085"
                        + "prometheus.io/scrape" = "true"
                      }
                    + generation       = (known after apply)
                    + labels           = {
                        + "app" = "cluster-autoscaler"
                      }
                    + name             = (known after apply)
                    + resource_version = (known after apply)
                    + uid              = (known after apply)
                  }
  
                + spec {
                    + automount_service_account_token  = true
                    + dns_policy                       = "ClusterFirst"
                    + enable_service_links             = true
                    + host_ipc                         = false
                    + host_network                     = false
                    + host_pid                         = false
                    + hostname                         = (known after apply)
                    + node_name                        = (known after apply)
                    + restart_policy                   = "Always"
                    + service_account_name             = "cluster-autoscaler"
                    + share_process_namespace          = false
                    + termination_grace_period_seconds = 30
  
                    + container {
                        + command                    = [
                            + "./cluster-autoscaler",
                            + "--v=4",
                            + "--stderrthreshold=info",
                            + "--cloud-provider=aws",
                            + "--skip-nodes-with-local-storage=false",
                            + "--expander=least-waste",
                            + "--node-group-auto-discovery=asg:tag=k8s.io/cluster-autoscaler/enabled,k8s.io/cluster-autoscaler/mumbai-dev-39e419",
                            + "--balance-similar-node-groups",
                            + "--skip-nodes-with-system-pods=false",
                          ]
                        + image                      = "k8s.gcr.io/autoscaling/cluster-autoscaler:v1.19.1"
                        + image_pull_policy          = "Always"
                        + name                       = "cluster-autoscaler"
                        + stdin                      = false
                        + stdin_once                 = false
                        + termination_message_path   = "/dev/termination-log"
                        + termination_message_policy = (known after apply)
                        + tty                        = false
  
                        + resources {
                            + limits   = {
                                + "cpu"    = "100m"
                                + "memory" = "600Mi"
                              }
                            + requests = {
                                + "cpu"    = "100m"
                                + "memory" = "600Mi"
                              }
                          }
  
                        + volume_mount {
                            + mount_path        = "/etc/ssl/certs/ca-certificates.crt"
                            + mount_propagation = "None"
                            + name              = "ssl-certs"
                            + read_only         = true
                          }
                      }
  
                    + image_pull_secrets {
                        + name = (known after apply)
                      }
  
                    + readiness_gate {
                        + condition_type = (known after apply)
                      }
  
                    + volume {
                        + name = "ssl-certs"
  
                        + host_path {
                            + path = "/etc/ssl/certs/ca-bundle.crt"
                          }
                      }
                  }
              }
          }
      }
  
    # module.mcmp.kubernetes_role.cluster_autoscaler will be created
    + resource "kubernetes_role" "cluster_autoscaler" {
        + id = (known after apply)
  
        + metadata {
            + generation       = (known after apply)
            + labels           = {
                + "k8s-addon" = "cluster-autoscaler.addons.k8s.io"
                + "k8s-app"   = "cluster-autoscaler"
              }
            + name             = "cluster-autoscaler"
            + namespace        = "kube-system"
            + resource_version = (known after apply)
            + uid              = (known after apply)
          }
  
        + rule {
            + api_groups = [
                + "",
              ]
            + resources  = [
                + "configmaps",
              ]
            + verbs      = [
                + "create",
                + "list",
                + "watch",
              ]
          }
        + rule {
            + api_groups     = [
                + "",
              ]
            + resource_names = [
                + "cluster-autoscaler-priority-expander",
                + "cluster-autoscaler-status",
              ]
            + resources      = [
                + "configmaps",
              ]
            + verbs          = [
                + "delete",
                + "get",
                + "update",
                + "watch",
              ]
          }
      }
  
    # module.mcmp.kubernetes_role_binding.cluster_autoscaler will be created
    + resource "kubernetes_role_binding" "cluster_autoscaler" {
        + id = (known after apply)
  
        + metadata {
            + generation       = (known after apply)
            + labels           = {
                + "k8s-addon" = "cluster-autoscaler.addons.k8s.io"
                + "k8s-app"   = "cluster-autoscaler"
              }
            + name             = "cluster-autoscaler"
            + namespace        = "kube-system"
            + resource_version = (known after apply)
            + uid              = (known after apply)
          }
  
        + role_ref {
            + api_group = "rbac.authorization.k8s.io"
            + kind      = "Role"
            + name      = "cluster-autoscaler"
          }
  
        + subject {
            + api_group = (known after apply)
            + kind      = "ServiceAccount"
            + name      = "cluster-autoscaler"
            + namespace = "kube-system"
          }
      }
  
    # module.mcmp.kubernetes_service_account.alb will be created
    + resource "kubernetes_service_account" "alb" {
        + automount_service_account_token = true
        + default_secret_name             = (known after apply)
        + id                              = (known after apply)
  
        + metadata {
            + annotations      = (known after apply)
            + generation       = (known after apply)
            + labels           = {
                + "app.kubernetes.io/component" = "controller"
                + "app.kubernetes.io/name"      = "aws-load-balancer-controller"
              }
            + name             = "aws-load-balancer-controller"
            + namespace        = "kube-system"
            + resource_version = (known after apply)
            + uid              = (known after apply)
          }
      }
  
    # module.mcmp.kubernetes_service_account.cluster_autoscaler will be created
    + resource "kubernetes_service_account" "cluster_autoscaler" {
        + automount_service_account_token = true
        + default_secret_name             = (known after apply)
        + id                              = (known after apply)
  
        + metadata {
            + annotations      = (known after apply)
            + generation       = (known after apply)
            + labels           = {
                + "k8s-addon" = "cluster-autoscaler.addons.k8s.io"
                + "k8s-app"   = "cluster-autoscaler"
              }
            + name             = "cluster-autoscaler"
            + namespace        = "kube-system"
            + resource_version = (known after apply)
            + uid              = (known after apply)
          }
      }
  
    # module.mcmp.mongodbatlas_cluster.cluster["corelite"] will be created
    + resource "mongodbatlas_cluster" "cluster" {
        + auto_scaling_compute_enabled                    = (known after apply)
        + auto_scaling_compute_scale_down_enabled         = (known after apply)
        + auto_scaling_disk_gb_enabled                    = true
        + backing_provider_name                           = (known after apply)
        + backup_enabled                                  = false
        + cluster_id                                      = (known after apply)
        + cluster_type                                    = "REPLICASET"
        + connection_strings                              = (known after apply)
        + container_id                                    = (known after apply)
        + disk_size_gb                                    = 32
        + encryption_at_rest_provider                     = (known after apply)
        + id                                              = (known after apply)
        + mongo_db_major_version                          = "4.4"
        + mongo_db_version                                = (known after apply)
        + mongo_uri                                       = (known after apply)
        + mongo_uri_updated                               = (known after apply)
        + mongo_uri_with_options                          = (known after apply)
        + name                                            = "mumbai-dev-39e419-corelite-global"
        + num_shards                                      = 1
        + paused                                          = (known after apply)
        + pit_enabled                                     = (known after apply)
        + project_id                                      = (known after apply)
        + provider_auto_scaling_compute_max_instance_size = (known after apply)
        + provider_auto_scaling_compute_min_instance_size = (known after apply)
        + provider_backup_enabled                         = true
        + provider_disk_iops                              = (known after apply)
        + provider_disk_type_name                         = (known after apply)
        + provider_encrypt_ebs_volume                     = (known after apply)
        + provider_encrypt_ebs_volume_flag                = (known after apply)
        + provider_instance_size_name                     = "M10"
        + provider_name                                   = "AWS"
        + provider_region_name                            = (known after apply)
        + provider_volume_type                            = (known after apply)
        + replication_factor                              = (known after apply)
        + snapshot_backup_policy                          = (known after apply)
        + srv_address                                     = (known after apply)
        + state_name                                      = (known after apply)
  
        + advanced_configuration {
            + fail_index_key_too_long              = (known after apply)
            + javascript_enabled                   = (known after apply)
            + minimum_enabled_tls_protocol         = (known after apply)
            + no_table_scan                        = (known after apply)
            + oplog_size_mb                        = (known after apply)
            + sample_refresh_interval_bi_connector = (known after apply)
            + sample_size_bi_connector             = (known after apply)
          }
  
        + bi_connector_config {
            + enabled         = (known after apply)
            + read_preference = (known after apply)
          }
  
        + labels {
            + key   = (known after apply)
            + value = (known after apply)
          }
  
        + replication_specs {
            + id         = (known after apply)
            + num_shards = 1
            + zone_name  = "ZoneName managed by Terraform"
  
            + regions_config {
                + analytics_nodes = 0
                + electable_nodes = 3
                + priority        = 7
                + read_only_nodes = 0
                + region_name     = "AP_SOUTH_1"
              }
          }
      }
  
    # module.mcmp.mongodbatlas_cluster.cluster["coreplus"] will be created
    + resource "mongodbatlas_cluster" "cluster" {
        + auto_scaling_compute_enabled                    = (known after apply)
        + auto_scaling_compute_scale_down_enabled         = (known after apply)
        + auto_scaling_disk_gb_enabled                    = true
        + backing_provider_name                           = (known after apply)
        + backup_enabled                                  = false
        + cluster_id                                      = (known after apply)
        + cluster_type                                    = "REPLICASET"
        + connection_strings                              = (known after apply)
        + container_id                                    = (known after apply)
        + disk_size_gb                                    = 32
        + encryption_at_rest_provider                     = (known after apply)
        + id                                              = (known after apply)
        + mongo_db_major_version                          = "4.4"
        + mongo_db_version                                = (known after apply)
        + mongo_uri                                       = (known after apply)
        + mongo_uri_updated                               = (known after apply)
        + mongo_uri_with_options                          = (known after apply)
        + name                                            = "mumbai-dev-39e419-coreplus-global"
        + num_shards                                      = 1
        + paused                                          = (known after apply)
        + pit_enabled                                     = (known after apply)
        + project_id                                      = (known after apply)
        + provider_auto_scaling_compute_max_instance_size = (known after apply)
        + provider_auto_scaling_compute_min_instance_size = (known after apply)
        + provider_backup_enabled                         = true
        + provider_disk_iops                              = (known after apply)
        + provider_disk_type_name                         = (known after apply)
        + provider_encrypt_ebs_volume                     = (known after apply)
        + provider_encrypt_ebs_volume_flag                = (known after apply)
        + provider_instance_size_name                     = "M10"
        + provider_name                                   = "AWS"
        + provider_region_name                            = (known after apply)
        + provider_volume_type                            = (known after apply)
        + replication_factor                              = (known after apply)
        + snapshot_backup_policy                          = (known after apply)
        + srv_address                                     = (known after apply)
        + state_name                                      = (known after apply)
  
        + advanced_configuration {
            + fail_index_key_too_long              = (known after apply)
            + javascript_enabled                   = (known after apply)
            + minimum_enabled_tls_protocol         = (known after apply)
            + no_table_scan                        = (known after apply)
            + oplog_size_mb                        = (known after apply)
            + sample_refresh_interval_bi_connector = (known after apply)
            + sample_size_bi_connector             = (known after apply)
          }
  
        + bi_connector_config {
            + enabled         = (known after apply)
            + read_preference = (known after apply)
          }
  
        + labels {
            + key   = (known after apply)
            + value = (known after apply)
          }
  
        + replication_specs {
            + id         = (known after apply)
            + num_shards = 1
            + zone_name  = "ZoneName managed by Terraform"
  
            + regions_config {
                + analytics_nodes = 0
                + electable_nodes = 3
                + priority        = 7
                + read_only_nodes = 0
                + region_name     = "AP_SOUTH_1"
              }
          }
      }
  
    # module.mcmp.mongodbatlas_custom_dns_configuration_cluster_aws.project[0] will be created
    + resource "mongodbatlas_custom_dns_configuration_cluster_aws" "project" {
        + enabled    = true
        + id         = (known after apply)
        + project_id = (known after apply)
      }
  
    # module.mcmp.mongodbatlas_database_user.database["corelite"] will be created
    + resource "mongodbatlas_database_user" "database" {
        + auth_database_name = "admin"
        + aws_iam_type       = "NONE"
        + id                 = (known after apply)
        + ldap_auth_type     = "NONE"
        + password           = (sensitive value)
        + project_id         = (known after apply)
        + username           = "corelitedbAdmin"
        + x509_type          = "NONE"
  
        + labels {
            + key   = (known after apply)
            + value = (known after apply)
          }
  
        + roles {
            + collection_name = (known after apply)
            + database_name   = "admin"
            + role_name       = "atlasAdmin"
          }
  
        + scopes {
            + name = "mumbai-dev-39e419-corelite-global"
            + type = "CLUSTER"
          }
      }
  
    # module.mcmp.mongodbatlas_database_user.database["coreplus"] will be created
    + resource "mongodbatlas_database_user" "database" {
        + auth_database_name = "admin"
        + aws_iam_type       = "NONE"
        + id                 = (known after apply)
        + ldap_auth_type     = "NONE"
        + password           = (sensitive value)
        + project_id         = (known after apply)
        + username           = "coreplusdbAdmin"
        + x509_type          = "NONE"
  
        + labels {
            + key   = (known after apply)
            + value = (known after apply)
          }
  
        + roles {
            + collection_name = (known after apply)
            + database_name   = "admin"
            + role_name       = "atlasAdmin"
          }
  
        + scopes {
            + name = "mumbai-dev-39e419-coreplus-global"
            + type = "CLUSTER"
          }
      }
  
    # module.mcmp.mongodbatlas_network_peering.vpc_peering[0] will be created
    + resource "mongodbatlas_network_peering" "vpc_peering" {
        + accepter_region_name   = "***"
        + atlas_cidr_block       = (known after apply)
        + atlas_gcp_project_id   = (known after apply)
        + atlas_id               = (known after apply)
        + atlas_vpc_name         = (known after apply)
        + aws_account_id         = "794296633202"
        + azure_directory_id     = (known after apply)
        + azure_subscription_id  = (known after apply)
        + connection_id          = (known after apply)
        + container_id           = (known after apply)
        + error_message          = (known after apply)
        + error_state            = (known after apply)
        + error_state_name       = (known after apply)
        + gcp_project_id         = (known after apply)
        + id                     = (known after apply)
        + network_name           = (known after apply)
        + peer_id                = (known after apply)
        + project_id             = (known after apply)
        + provider_name          = "AWS"
        + resource_group_name    = (known after apply)
        + route_table_cidr_block = "172.16.0.0/16"
        + status                 = (known after apply)
        + status_name            = (known after apply)
        + vnet_name              = (known after apply)
        + vpc_id                 = (known after apply)
      }
  
    # module.mcmp.mongodbatlas_project.project[0] will be created
    + resource "mongodbatlas_project" "project" {
        + cluster_count = (known after apply)
        + created       = (known after apply)
        + id            = (known after apply)
        + name          = "mumbai-dev-39e419"
        + org_id        = "60a55d5a155e017f06b60961"
      }
  
    # module.mcmp.mongodbatlas_project_ip_access_list.cidr_block[0] will be created
    + resource "mongodbatlas_project_ip_access_list" "cidr_block" {
        + aws_security_group = (known after apply)
        + cidr_block         = "172.16.0.0/16"
        + comment            = "mumbai-dev-39e419"
        + id                 = (known after apply)
        + ip_address         = (known after apply)
        + project_id         = (known after apply)
      }
  
    # module.mcmp.module.cloudamqp["actions"].data.cloudamqp_credentials.credentials will be read during apply
    # (config refers to values not yet known)
   <= data "cloudamqp_credentials" "credentials"  {
        + id          = (known after apply)
        + instance_id = (known after apply)
      }
  
    # module.mcmp.module.cloudamqp["actions"].data.cloudamqp_vpc_info.vpc_info will be read during apply
    # (config refers to values not yet known)
   <= data "cloudamqp_vpc_info" "vpc_info"  {
        + id                = (known after apply)
        + instance_id       = (known after apply)
        + name              = (known after apply)
        + owner_id          = (known after apply)
        + security_group_id = (known after apply)
        + vpc_subnet        = (known after apply)
      }
  
    # module.mcmp.module.cloudamqp["actions"].data.template_file.rabbitmq-configuration will be read during apply
    # (config refers to values not yet known)
   <= data "template_file" "rabbitmq-configuration"  {
        + id       = (known after apply)
        + rendered = (known after apply)
        + template = <<-EOT
              #!/bin/bash
              
              log (){
                echo "######## %241 ########"
              }
              
              grant_default_vhost_access() {
                # Granting default Vhost '/' access to Rabbitmq user
                log "Granting default Vhost '/' access to Rabbitmq user"
              
                curl -s --user %24{rabbitmq-user}:%24{rabbitmq-password} -XPUT https://%24{rabbitmq-host}/api/permissions/%2F/%24{rabbitmq-user} -d\
                 '{"configure":".","write":".","read":".*"}'\
                 -H 'Content-type: application/json'
              }
              
              _main() {
               grant_default_vhost_access
              }
              
              _main "%24@"
          EOT
        + vars     = {
            + "rabbitmq-host"     = (known after apply)
            + "rabbitmq-password" = (sensitive)
            + "rabbitmq-user"     = (sensitive)
          }
      }
  
    # module.mcmp.module.cloudamqp["actions"].aws_route.accepter_route[0] will be created
    + resource "aws_route" "accepter_route" {
        + destination_cidr_block    = "10.40.75.0/24"
        + id                        = (known after apply)
        + instance_id               = (known after apply)
        + instance_owner_id         = (known after apply)
        + network_interface_id      = (known after apply)
        + origin                    = (known after apply)
        + route_table_id            = (known after apply)
        + state                     = (known after apply)
        + vpc_peering_connection_id = (known after apply)
      }
  
    # module.mcmp.module.cloudamqp["actions"].aws_vpc_peering_connection.aws_vpc_peering[0] will be created
    + resource "aws_vpc_peering_connection" "aws_vpc_peering" {
        + accept_status = (known after apply)
        + id            = (known after apply)
        + peer_owner_id = (known after apply)
        + peer_region   = (known after apply)
        + peer_vpc_id   = (known after apply)
        + tags          = {
            + "Name" = "mumbai-dev-39e419-actions-cloudamqp"
          }
        + tags_all      = {
            + "Name" = "mumbai-dev-39e419-actions-cloudamqp"
          }
        + vpc_id        = (known after apply)
  
        + accepter {
            + allow_classic_link_to_remote_vpc = (known after apply)
            + allow_remote_vpc_dns_resolution  = (known after apply)
            + allow_vpc_to_remote_classic_link = (known after apply)
          }
  
        + requester {
            + allow_classic_link_to_remote_vpc = (known after apply)
            + allow_remote_vpc_dns_resolution  = (known after apply)
            + allow_vpc_to_remote_classic_link = (known after apply)
          }
      }
  
    # module.mcmp.module.cloudamqp["actions"].aws_vpc_peering_connection_options.aws_vpc_peering_options[0] will be created
    + resource "aws_vpc_peering_connection_options" "aws_vpc_peering_options" {
        + id                        = (known after apply)
        + vpc_peering_connection_id = (known after apply)
  
        + accepter {
            + allow_classic_link_to_remote_vpc = (known after apply)
            + allow_remote_vpc_dns_resolution  = (known after apply)
            + allow_vpc_to_remote_classic_link = (known after apply)
          }
  
        + requester {
            + allow_classic_link_to_remote_vpc = false
            + allow_remote_vpc_dns_resolution  = true
            + allow_vpc_to_remote_classic_link = false
          }
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_alarm.cpu_alarm will be created
    + resource "cloudamqp_alarm" "cpu_alarm" {
        + enabled         = true
        + id              = (known after apply)
        + instance_id     = (known after apply)
        + recipients      = (known after apply)
        + time_threshold  = 600
        + type            = "cpu"
        + value_threshold = 80
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_alarm.disk_alarm will be created
    + resource "cloudamqp_alarm" "disk_alarm" {
        + enabled         = true
        + id              = (known after apply)
        + instance_id     = (known after apply)
        + recipients      = (known after apply)
        + time_threshold  = 600
        + type            = "disk"
        + value_threshold = 5
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_alarm.memory_alarm will be created
    + resource "cloudamqp_alarm" "memory_alarm" {
        + enabled         = true
        + id              = (known after apply)
        + instance_id     = (known after apply)
        + recipients      = (known after apply)
        + time_threshold  = 600
        + type            = "memory"
        + value_threshold = 80
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_instance.instance will be created
    + resource "cloudamqp_instance" "instance" {
        + apikey            = (sensitive value)
        + dedicated         = (known after apply)
        + host              = (known after apply)
        + id                = (known after apply)
        + name              = "mumbai-dev-39e419-actions-global"
        + no_default_alarms = true
        + nodes             = 3
        + plan              = "bunny-3"
        + ready             = (known after apply)
        + region            = "amazon-web-services::***"
        + rmq_version       = "3.9.0"
        + tags              = []
        + url               = (sensitive value)
        + vhost             = (known after apply)
        + vpc_subnet        = "10.40.75.0/24"
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_integration_log.cloudwatch_log[0] will be created
    + resource "cloudamqp_integration_log" "cloudwatch_log" {
        + access_key_id     = (sensitive value)
        + id                = (known after apply)
        + instance_id       = (known after apply)
        + name              = "cloudwatchlog"
        + region            = "***"
        + secret_access_key = (sensitive value)
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_integration_metric.cloudwatch_metric[0] will be created
    + resource "cloudamqp_integration_metric" "cloudwatch_metric" {
        + access_key_id     = "***"
        + id                = (known after apply)
        + instance_id       = (known after apply)
        + name              = "cloudwatch_v2"
        + region            = "***"
        + secret_access_key = (sensitive value)
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_notification.recipient will be created
    + resource "cloudamqp_notification" "recipient" {
        + id          = (known after apply)
        + instance_id = (known after apply)
        + name        = "Sudarshan Narayanan"
        + type        = "email"
        + value       = "sudarshan.n@ibm.com"
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_plugin.plugin_rabbitmq_amqp1_0 will be created
    + resource "cloudamqp_plugin" "plugin_rabbitmq_amqp1_0" {
        + enabled     = true
        + id          = (known after apply)
        + instance_id = (known after apply)
        + name        = "rabbitmq_amqp1_0"
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_plugin.plugin_rabbitmq_auth_backend_cache will be created
    + resource "cloudamqp_plugin" "plugin_rabbitmq_auth_backend_cache" {
        + enabled     = true
        + id          = (known after apply)
        + instance_id = (known after apply)
        + name        = "rabbitmq_auth_backend_cache"
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_plugin.plugin_rabbitmq_auth_backend_http will be created
    + resource "cloudamqp_plugin" "plugin_rabbitmq_auth_backend_http" {
        + enabled     = true
        + id          = (known after apply)
        + instance_id = (known after apply)
        + name        = "rabbitmq_auth_backend_http"
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_plugin.plugin_rabbitmq_auth_mechanism_ssl will be created
    + resource "cloudamqp_plugin" "plugin_rabbitmq_auth_mechanism_ssl" {
        + enabled     = true
        + id          = (known after apply)
        + instance_id = (known after apply)
        + name        = "rabbitmq_auth_mechanism_ssl"
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_plugin.plugin_rabbitmq_mqtt will be created
    + resource "cloudamqp_plugin" "plugin_rabbitmq_mqtt" {
        + enabled     = true
        + id          = (known after apply)
        + instance_id = (known after apply)
        + name        = "rabbitmq_mqtt"
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_security_firewall.firewall_settings will be created
    + resource "cloudamqp_security_firewall" "firewall_settings" {
        + id          = (known after apply)
        + instance_id = (known after apply)
  
        + rules {
            + description = "Access to EKS VPC"
            + ip          = "172.16.0.0/16"
            + ports       = [
                + 15672,
              ]
            + services    = [
                + "AMQP",
                + "AMQPS",
              ]
          }
        + rules {
            + description = "Public access for local script exec"
            + ip          = (known after apply)
            + ports       = [
                + 15672,
              ]
            + services    = [
                + "HTTPS",
              ]
          }
      }
  
    # module.mcmp.module.cloudamqp["actions"].cloudamqp_vpc_peering.vpc_accept_peering[0] will be created
    + resource "cloudamqp_vpc_peering" "vpc_accept_peering" {
        + id          = (known after apply)
        + instance_id = (known after apply)
        + peering_id  = (known after apply)
        + status      = (known after apply)
      }
  
    # module.mcmp.module.cloudamqp["actions"].null_resource.rabbimq_config_exec will be created
    + resource "null_resource" "rabbimq_config_exec" {
        + id = (known after apply)
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].data.cloudamqp_credentials.credentials will be read during apply
    # (config refers to values not yet known)
   <= data "cloudamqp_credentials" "credentials"  {
        + id          = (known after apply)
        + instance_id = (known after apply)
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].data.cloudamqp_vpc_info.vpc_info will be read during apply
    # (config refers to values not yet known)
   <= data "cloudamqp_vpc_info" "vpc_info"  {
        + id                = (known after apply)
        + instance_id       = (known after apply)
        + name              = (known after apply)
        + owner_id          = (known after apply)
        + security_group_id = (known after apply)
        + vpc_subnet        = (known after apply)
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].data.template_file.rabbitmq-configuration will be read during apply
    # (config refers to values not yet known)
   <= data "template_file" "rabbitmq-configuration"  {
        + id       = (known after apply)
        + rendered = (known after apply)
        + template = <<-EOT
              #!/bin/bash
              
              log (){
                echo "######## %241 ########"
              }
              
              grant_default_vhost_access() {
                # Granting default Vhost '/' access to Rabbitmq user
                log "Granting default Vhost '/' access to Rabbitmq user"
              
                curl -s --user %24{rabbitmq-user}:%24{rabbitmq-password} -XPUT https://%24{rabbitmq-host}/api/permissions/%2F/%24{rabbitmq-user} -d\
                 '{"configure":".","write":".","read":".*"}'\
                 -H 'Content-type: application/json'
              }
              
              _main() {
               grant_default_vhost_access
              }
              
              _main "%24@"
          EOT
        + vars     = {
            + "rabbitmq-host"     = (known after apply)
            + "rabbitmq-password" = (sensitive)
            + "rabbitmq-user"     = (sensitive)
          }
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].aws_route.accepter_route[0] will be created
    + resource "aws_route" "accepter_route" {
        + destination_cidr_block    = "10.40.74.0/24"
        + id                        = (known after apply)
        + instance_id               = (known after apply)
        + instance_owner_id         = (known after apply)
        + network_interface_id      = (known after apply)
        + origin                    = (known after apply)
        + route_table_id            = (known after apply)
        + state                     = (known after apply)
        + vpc_peering_connection_id = (known after apply)
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].aws_vpc_peering_connection.aws_vpc_peering[0] will be created
    + resource "aws_vpc_peering_connection" "aws_vpc_peering" {
        + accept_status = (known after apply)
        + id            = (known after apply)
        + peer_owner_id = (known after apply)
        + peer_region   = (known after apply)
        + peer_vpc_id   = (known after apply)
        + tags          = {
            + "Name" = "mumbai-dev-39e419-coreplus-cloudamqp"
          }
        + tags_all      = {
            + "Name" = "mumbai-dev-39e419-coreplus-cloudamqp"
          }
        + vpc_id        = (known after apply)
  
        + accepter {
            + allow_classic_link_to_remote_vpc = (known after apply)
            + allow_remote_vpc_dns_resolution  = (known after apply)
            + allow_vpc_to_remote_classic_link = (known after apply)
          }
  
        + requester {
            + allow_classic_link_to_remote_vpc = (known after apply)
            + allow_remote_vpc_dns_resolution  = (known after apply)
            + allow_vpc_to_remote_classic_link = (known after apply)
          }
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].aws_vpc_peering_connection_options.aws_vpc_peering_options[0] will be created
    + resource "aws_vpc_peering_connection_options" "aws_vpc_peering_options" {
        + id                        = (known after apply)
        + vpc_peering_connection_id = (known after apply)
  
        + accepter {
            + allow_classic_link_to_remote_vpc = (known after apply)
            + allow_remote_vpc_dns_resolution  = (known after apply)
            + allow_vpc_to_remote_classic_link = (known after apply)
          }
  
        + requester {
            + allow_classic_link_to_remote_vpc = false
            + allow_remote_vpc_dns_resolution  = true
            + allow_vpc_to_remote_classic_link = false
          }
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_alarm.cpu_alarm will be created
    + resource "cloudamqp_alarm" "cpu_alarm" {
        + enabled         = true
        + id              = (known after apply)
        + instance_id     = (known after apply)
        + recipients      = (known after apply)
        + time_threshold  = 600
        + type            = "cpu"
        + value_threshold = 80
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_alarm.disk_alarm will be created
    + resource "cloudamqp_alarm" "disk_alarm" {
        + enabled         = true
        + id              = (known after apply)
        + instance_id     = (known after apply)
        + recipients      = (known after apply)
        + time_threshold  = 600
        + type            = "disk"
        + value_threshold = 5
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_alarm.memory_alarm will be created
    + resource "cloudamqp_alarm" "memory_alarm" {
        + enabled         = true
        + id              = (known after apply)
        + instance_id     = (known after apply)
        + recipients      = (known after apply)
        + time_threshold  = 600
        + type            = "memory"
        + value_threshold = 80
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_instance.instance will be created
    + resource "cloudamqp_instance" "instance" {
        + apikey            = (sensitive value)
        + dedicated         = (known after apply)
        + host              = (known after apply)
        + id                = (known after apply)
        + name              = "mumbai-dev-39e419-coreplus-global"
        + no_default_alarms = true
        + nodes             = 3
        + plan              = "bunny-3"
        + ready             = (known after apply)
        + region            = "amazon-web-services::***"
        + rmq_version       = "3.9.0"
        + tags              = []
        + url               = (sensitive value)
        + vhost             = (known after apply)
        + vpc_subnet        = "10.40.74.0/24"
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_integration_log.cloudwatch_log[0] will be created
    + resource "cloudamqp_integration_log" "cloudwatch_log" {
        + access_key_id     = (sensitive value)
        + id                = (known after apply)
        + instance_id       = (known after apply)
        + name              = "cloudwatchlog"
        + region            = "***"
        + secret_access_key = (sensitive value)
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_integration_metric.cloudwatch_metric[0] will be created
    + resource "cloudamqp_integration_metric" "cloudwatch_metric" {
        + access_key_id     = "***"
        + id                = (known after apply)
        + instance_id       = (known after apply)
        + name              = "cloudwatch_v2"
        + region            = "***"
        + secret_access_key = (sensitive value)
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_notification.recipient will be created
    + resource "cloudamqp_notification" "recipient" {
        + id          = (known after apply)
        + instance_id = (known after apply)
        + name        = "Sudarshan Narayanan"
        + type        = "email"
        + value       = "sudarshan.n@ibm.com"
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_plugin.plugin_rabbitmq_amqp1_0 will be created
    + resource "cloudamqp_plugin" "plugin_rabbitmq_amqp1_0" {
        + enabled     = true
        + id          = (known after apply)
        + instance_id = (known after apply)
        + name        = "rabbitmq_amqp1_0"
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_plugin.plugin_rabbitmq_auth_backend_cache will be created
    + resource "cloudamqp_plugin" "plugin_rabbitmq_auth_backend_cache" {
        + enabled     = true
        + id          = (known after apply)
        + instance_id = (known after apply)
        + name        = "rabbitmq_auth_backend_cache"
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_plugin.plugin_rabbitmq_auth_backend_http will be created
    + resource "cloudamqp_plugin" "plugin_rabbitmq_auth_backend_http" {
        + enabled     = true
        + id          = (known after apply)
        + instance_id = (known after apply)
        + name        = "rabbitmq_auth_backend_http"
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_plugin.plugin_rabbitmq_auth_mechanism_ssl will be created
    + resource "cloudamqp_plugin" "plugin_rabbitmq_auth_mechanism_ssl" {
        + enabled     = true
        + id          = (known after apply)
        + instance_id = (known after apply)
        + name        = "rabbitmq_auth_mechanism_ssl"
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_plugin.plugin_rabbitmq_mqtt will be created
    + resource "cloudamqp_plugin" "plugin_rabbitmq_mqtt" {
        + enabled     = true
        + id          = (known after apply)
        + instance_id = (known after apply)
        + name        = "rabbitmq_mqtt"
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_security_firewall.firewall_settings will be created
    + resource "cloudamqp_security_firewall" "firewall_settings" {
        + id          = (known after apply)
        + instance_id = (known after apply)
  
        + rules {
            + description = "Access to EKS VPC"
            + ip          = "172.16.0.0/16"
            + ports       = [
                + 15672,
              ]
            + services    = [
                + "AMQP",
                + "AMQPS",
              ]
          }
        + rules {
            + description = "Public access for local script exec"
            + ip          = (known after apply)
            + ports       = [
                + 15672,
              ]
            + services    = [
                + "HTTPS",
              ]
          }
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_vpc_peering.vpc_accept_peering[0] will be created
    + resource "cloudamqp_vpc_peering" "vpc_accept_peering" {
        + id          = (known after apply)
        + instance_id = (known after apply)
        + peering_id  = (known after apply)
        + status      = (known after apply)
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].null_resource.rabbimq_config_exec will be created
    + resource "null_resource" "rabbimq_config_exec" {
        + id = (known after apply)
      }
  
    # module.mcmp.module.elastic_cloud.data.aws_route53_zone.internal[0] will be read during apply
    # (config refers to values not yet known)
   <= data "aws_route53_zone" "internal"  {
        + caller_reference           = (known after apply)
        + comment                    = (known after apply)
        + id                         = (known after apply)
        + linked_service_description = (known after apply)
        + linked_service_principal   = (known after apply)
        + name                       = "vpce.***.aws.elastic-cloud.com"
        + name_servers               = (known after apply)
        + private_zone               = true
        + resource_record_set_count  = (known after apply)
        + tags                       = (known after apply)
        + vpc_id                     = (known after apply)
        + zone_id                    = (known after apply)
      }
  
    # module.mcmp.module.elastic_cloud.data.ec_deployment.elastic_cloud["aiops"] will be read during apply
    # (config refers to values not yet known)
   <= data "ec_deployment" "elastic_cloud"  {
        + alias                  = (known after apply)
        + apm                    = (known after apply)
        + deployment_template_id = (known after apply)
        + elasticsearch          = (known after apply)
        + enterprise_search      = (known after apply)
        + healthy                = (known after apply)
        + id                     = (known after apply)
        + kibana                 = (known after apply)
        + name                   = (known after apply)
        + observability          = (known after apply)
        + region                 = (known after apply)
        + tags                   = (known after apply)
        + traffic_filter         = (known after apply)
  
        + timeouts {
            + default = (known after apply)
          }
      }
  
    # module.mcmp.module.elastic_cloud.aws_route53_record.elastic_cloud_service[0] will be created
    + resource "aws_route53_record" "elastic_cloud_service" {
        + allow_overwrite = (known after apply)
        + fqdn            = (known after apply)
        + id              = (known after apply)
        + name            = "*.vpce.***.aws.elastic-cloud.com"
        + records         = (known after apply)
        + ttl             = 300
        + type            = "CNAME"
        + zone_id         = (known after apply)
      }
  
    # module.mcmp.module.elastic_cloud.aws_route53_zone.internal[0] will be created
    + resource "aws_route53_zone" "internal" {
        + comment       = "Managed by Terraform"
        + force_destroy = false
        + id            = (known after apply)
        + name          = "vpce.***.aws.elastic-cloud.com"
        + name_servers  = (known after apply)
        + tags_all      = (known after apply)
        + zone_id       = (known after apply)
  
        + vpc {
            + vpc_id     = (known after apply)
            + vpc_region = (known after apply)
          }
      }
  
    # module.mcmp.module.elastic_cloud.aws_vpc_endpoint.elastic_cloud[0] will be created
    + resource "aws_vpc_endpoint" "elastic_cloud" {
        + arn                   = (known after apply)
        + cidr_blocks           = (known after apply)
        + dns_entry             = (known after apply)
        + id                    = (known after apply)
        + network_interface_ids = (known after apply)
        + owner_id              = (known after apply)
        + policy                = (known after apply)
        + prefix_list_id        = (known after apply)
        + private_dns_enabled   = false
        + requester_managed     = (known after apply)
        + route_table_ids       = (known after apply)
        + security_group_ids    = (known after apply)
        + service_name          = "com.amazonaws.vpce.***.vpce-svc-0e9c1ae5caa269d1b"
        + state                 = (known after apply)
        + subnet_ids            = (known after apply)
        + tags_all              = (known after apply)
        + vpc_endpoint_type     = "Interface"
        + vpc_id                = (known after apply)
      }
  
    # module.mcmp.module.elastic_cloud.ec_deployment.elastic_cloud["aiops"] will be created
    + resource "ec_deployment" "elastic_cloud" {
        + alias                  = (known after apply)
        + apm_secret_token       = (sensitive value)
        + deployment_template_id = "aws-io-optimized-v2"
        + elasticsearch_password = (sensitive value)
        + elasticsearch_username = (known after apply)
        + id                     = (known after apply)
        + name                   = "mumbai-dev-39e419-aiops"
        + region                 = "aws-***"
        + tags                   = {
            + "Environment"      = "dev"
            + "Name"             = "mumbai-dev-39e419-aiops"
            + "environment_type" = "dev"
          }
        + traffic_filter         = (known after apply)
        + version                = "7.13.4"
  
        + elasticsearch {
            + autoscale      = "false"
            + cloud_id       = (known after apply)
            + http_endpoint  = (known after apply)
            + https_endpoint = (known after apply)
            + ref_id         = "main-elasticsearch"
            + region         = (known after apply)
            + resource_id    = (known after apply)
  
            + topology {
                + id                        = "hot_content"
                + instance_configuration_id = (known after apply)
                + node_roles                = (known after apply)
                + node_type_data            = (known after apply)
                + node_type_ingest          = (known after apply)
                + node_type_master          = (known after apply)
                + node_type_ml              = (known after apply)
                + size                      = "1g"
                + size_resource             = "memory"
                + zone_count                = (known after apply)
  
                + autoscaling {
                    + max_size             = "32g"
                    + max_size_resource    = (known after apply)
                    + min_size             = (known after apply)
                    + min_size_resource    = (known after apply)
                    + policy_override_json = (known after apply)
                  }
              }
  
            + trust_account {
                + account_id      = (known after apply)
                + trust_all       = (known after apply)
                + trust_allowlist = (known after apply)
              }
  
            + trust_external {
                + relationship_id = (known after apply)
                + trust_all       = (known after apply)
                + trust_allowlist = (known after apply)
              }
          }
  
        + kibana {
            + elasticsearch_cluster_ref_id = "main-elasticsearch"
            + http_endpoint                = (known after apply)
            + https_endpoint               = (known after apply)
            + ref_id                       = "main-kibana"
            + region                       = (known after apply)
            + resource_id                  = (known after apply)
  
            + topology {
                + instance_configuration_id = (known after apply)
                + size                      = "1g"
                + size_resource             = "memory"
                + zone_count                = 2
              }
          }
      }
  
    # module.mcmp.module.elastic_cloud.ec_deployment_traffic_filter.traffic_filter[0] will be created
    + resource "ec_deployment_traffic_filter" "traffic_filter" {
        + id                 = (known after apply)
        + include_by_default = false
        + name               = "VPC private link"
        + region             = "aws-***"
        + type               = "vpce"
  
        + rule {
            + id     = (known after apply)
            + source = (known after apply)
          }
      }
  
    # module.mcmp.module.cloudamqp["actions"].module.myip.data.http.ip_address will be read during apply
    # (config refers to values not yet known)
   <= data "http" "ip_address"  {
        + body             = (known after apply)
        + id               = (known after apply)
        + request_headers  = {
            + "Accept" = "text/plain"
          }
        + response_headers = (known after apply)
        + url              = "https://api.ipify.org"
      }
  
    # module.mcmp.module.cloudamqp["coreplus"].module.myip.data.http.ip_address will be read during apply
    # (config refers to values not yet known)
   <= data "http" "ip_address"  {
        + body             = (known after apply)
        + id               = (known after apply)
        + request_headers  = {
            + "Accept" = "text/plain"
          }
        + response_headers = (known after apply)
        + url              = "https://api.ipify.org"
      }
  
  Plan: 120 to add, 0 to change, 0 to destroy.
  
  Changes to Outputs:
    + mcmp_module_outputs = (sensitive value)
  
  ─────────────────────────────────────────────────────────────────────────────
  
  Note: You didn't use the -out option to save this plan, so Terraform can't
  guarantee to take exactly these actions if you run "terraform apply" now.
  Releasing state lock. This may take a few moments...
  
   
   \`\`\`
   
  </details>